import React from 'react';
import styled from 'styled-components';
import AjylykImg from '../assets/ImagesGreatPersonalities/666.jpeg';

const Ajylyk = () => {
  return (
    <Container>
      <Title>
        <h2>Ажылык</h2>
      </Title>
      <Image src={AjylykImg} alt="Ajylyk" />
      <Text>
        Алла Таала адамзатты жаратып аларга акыреттеги түшүмүн көп кылып камдоо
        үчүн пенделер толук бактылуулука жетүү үчүн Ислам динин белек катары
        тартуу кылган. Мына ошол Ислам дини негизинен беш түркүктүн үстүнө
        курулгандыгы тууралуу төмөндөгү хадистерде келген. <br />
        <br />
        <b>
          Ибн Умар (Алла андан ыраазы болсун) баяндайт: Пайгамбарыбыз (Алланын
          салам жана салаваттар болсун) айтты: «Ислам дини беш түркүктүн үстүнө
          курулган. 1-Алладан башка сыйынууга татыктуу зат жок жана Мухаммад
          (Алланын салам жана салаваттар болсун) Анын элчиси экендигине күбөлүк
          берүү 2-Намазды тургузуу 3-Зекет берүү 4-Рамазан айынын орозосун
          кармоо 5-Ажылык кылуу. Жолуна кудурети жеткен кишиге ажылык милдетин
          аткаруу».
        </b>
        <br />
        <span>(Бухари, Муслим)</span>
        <br />
        <br />
        Ушул жогоруда эскерилген хадистеги эң акыркы болуп айтылган амал бул
        ажылык амалы болуп эсептелет. Ошондуктан барыбыз ушул Ислам дининин
        түркүгү болгон беш амалды толук аткарууга шашылуубуз керек. Бирок, ар
        бир амалды ким, кандай аткаруу керек экенин өз темалары боюнча кеңири
        баяндалган китептерге көз жүгүртүү керек болот. Менин бул жерде айтайын
        дегеним, болгону ажылык амалын аткарууга кандай даярдыктарды көрүү
        керектиги жөнүндө гана кыскача маалымат бере кетүү. Ажылыктын пайдасы
        жана өкүмдөрү тууралуу көптөгөн аяттар түшүп,
        <br />
        <br />
        <b>
          Пайгамбарыбыз (Алланын салам жана салаваттар болсун) да бир нече
          хадистерди айтып кеткен. Ошондой эле дагы бир хадисте мындай деп
          айтылат, Ибрахим (ага Алланын саламы болсун) Каабаны куруп бүткөндө
          Алла Таалага мен куруп бүттүм деп кайрылды. Ошондо, Алла Таала элдерди
          ажылыкка келүүгө жарыя кыл деп өкүм берди.
        </b>
        <br />
        <br />{' '}
        <b>
          Ибрахим (ага Алланын саламы болсун):“О, Аллахым! Менин үнүм элдерге
          кантип жетет”, — деди. Алла Таала: “Үндү жеткирүү Менин
          жоопкерчилигимде”- деди. Ошентип, ал жарыя кылганда, анын үнүн асман –
          жердин ортосундагы бардык жан укту. Бул жарыя жөнүндө жогорудагы аятта
          ачык – айкын айтылды. Бүгүнкү күндө бул жарыянын элдерге кантип
          жеткендиги тууралуу талаш – тартыш кылып же, таң калып олтуруунун
          кажети деле жок. Анткени, уюлдук телефон менен бир мамлекеттен экинчи
          мамлекетке үн жетип турат. Бул аппараттарды жасаган адамдарды жараткан
          Алла, үндү бардык жанга жеткире албай калуусу мүмкүн эмес.
        </b>
        <br />
        <br />
        <b>
          Абу Хурайра (Алла андан ыраазы болсун) баяндайт: Пайгамбарыбыз
          (Алланын салам жана салаваттар болсун) айтты: «Эң жакшы ажылыктын
          сообу Бейиш гана болот».
        </b>{' '}
        <br />
        <span>(Бухари, Муслим)</span>
      </Text>
    </Container>
  );
};

const Container = styled.div`
  max-width: 800px;
  margin: 0 auto;
  text-align: center;
`;

const Title = styled.div`
  text-align: center;
  margin-bottom: 20px;

  h2 {
    font-size: 24px;
    font-weight: bold;
  }
`;

const Image = styled.img`
  width: 100%;
  max-height: 850px;
  object-fit: cover;
  border-radius: 8px;
  margin-bottom: 20px;
`;

const Text = styled.div`
  font-size: 16px;
  line-height: 1.6;
  color: #333;
`;

export default Ajylyk;
