import React from 'react';
import styled from 'styled-components';
import OrozoImage from '../assets/ImagesGreatPersonalities/555.jpeg';

const Orozo = () => {
  return (
    <Container>
      <Image src={OrozoImage} alt="Orozo" />
      <Content>
        <Title>Орозо жана куттуу Рамазан айы</Title>
        <Paragraph>
          Орозо – бул, Алла Тааланын буйругун аткарып, Анын ыраазылыгын табуу
          үчүн таң аткандан күн батканга чейин жеп-ичүүдөн, жыныстык катнаштан
          алыс болуу аркылуу аткарылган ибадат. Эң алгач орозо, намаз, зекет,
          кайыр-садака, зикир, Куран окуу, жардамдашуу, конок күтүү сыяктуу
          ибадаттар жана жакшылык иштер менен көркүнө чыккан Рамазан айы
          береке-кутка толгон ай. Ал айлардын эң улуусу. Бул айда Алла Таала
          пенделерине чеги жок жакшылыктарын жаадырат. Күнөөлөрүнөн арылгысы
          келген пенделер үчүн кечиримдүүлүктүн эшиктерин кеңири ачат. Ийненин
          көзүнчөлүк жакшылыкка тоодой сооп ыроолойт. Азирети Пайгамбарыбыз
          (САВ) мындай дейт: «Рамазан айы башталганда бейиштин эшиктери ачылып,
          тозоктун эшиктери жабылат. Шайтандар чынжырга байланат». (Бухари,
          БадулХолк, 11; Муслим, Сыям 1,2,4,5). Орозонун сырлары Убактылуу
          ырахаттардан баш тартып, түбөлүк жыргал жашоого Алла Таала Өзү буюрган
          дал ушул орозо ибадаты аркылуу жетүүгө болот. Орозо кармаган
          момун-мусулман адам эртеден кечке чейин ибадат кылып жаткандыгын жана
          напси менен күрөшүп жаткандыгын билиши керек. Орозо бизди сынак
          жашоодо адамга эң керектүү «чечкиндүүлүк, сабырдуулук, туруктуулук,
          эрктүүлүк, топуктуулук, шүгүрчүлүк, кайратмандык, напсинин азгырыгына
          алданбоо» сыяктуу касиеттерге тарбиялайт. Орозо – напсинин жеп –
          ичүүдөн, кумардан ары өтпөгөн түгүнбөс каалоолоруна каршы адамдын
          адамдык касиетин, ар-намысын, кадыр-баркын сактай турган улуу ибадат.
          Орозо адамды ач калтырып, жыныстык канташтан алыс кармоо менен
          Жараткан Алланын чексиз жакшылыктарын кадыр – баркын сездирет. Ошону
          менен бирге, кедей – кембагалдардын ал-абалын эске салып, аларга
          камкор мамиле жасоого шыктандырат. Шүгүр келтиргенди үйрөтөт. Орозо
          бул жагынан коомдук жашоодогу көрө албастык, ичи тарлык, өчөшүү,
          кастык, душмадык сыяктуу терс сапаттардын алдын алуучу эң таасирлүү
          ибадат. Орозо жеке эле бизге эмес, бизден мурун жашап өткөн коомдорго
          да парз кылынган. «Эй, ыйман келтиргендер! Орозо мурдагы коомдорго
          парз кылынгандай, Алладан коркушуңар үчүн силерге да парз кылынды».
          (Бакара сүрөсү, 183 – аят). Исламда парз болуп эсептелген ибадаттардын
          ар бири жүрөктөгү ар кандай рухий илдеттерге өз-өзүнчө дары сыяктуу.
          Напсинин түгөнбөгөн каалоолору, дүйнөнүн миң кубулма кооздуктары,
          көңүл ачуунун ар кандай ыплас түрлөрү руханий жана заттык ооруларды
          пайда кылат. Ал үчүн алдын алуу жана сактануу зарыл. Коргонуунун эң
          таасирлүүсү орозо болуп эсептелет. Пенде үчүн эмне пайдалуу, эмне
          зыяндуу экенин эң жакшы билген Алла Таала орозону Өзү буюрган. Чынында
          эле орозо шыпаалыгы жагынан жана дүйнөдөгү жана организимдеги көптөгөн
          оорулар үчүн эң мыкты дармек. Ошол себептен, ал Курандын тили менен
          айтканда, «саналуу гана күндөрдө» кармалат. Анткени, дары дайыма
          колдонулса, ден – соолук ага көнүп калат да, эч кандай пайдасы
          болбойт. «Мен мындан кийинки өмүрүмдүн акырына чейин орозо кармап
          өтөм!» — деген сахабасына Пайгамбарыбыз ушул себептен: Бүт өмүрүң
          орозо кармоо менен өткөргөн адамдын орозосу болбойт! – деп, үч жолу
          кайталаган. (Бухари, Саум, 55-57) . Отуз күндөн аз кармалган орозо
          таасирсиз боло тургандыгын, ал эми кырк күндөн ашыкчасы көнүмүш адатка
          айланып, анык толук пайдасы болбой тургандыгын дарыгерлер да
          аныкташкан. Орозо адамды белгилүү убакыт аралыгында жеп-ичүүдөн
          тыйылуу аркылуу эрктүүлүккө үйрөтөт. Ошондой эле, тамаксоолуктун
          кесепетинен пайда боло турган оорулардын алдын алат. Организмдеги бир
          жыл бою аралыксыз иштеген тамак сиңирүү системасы орозодо бир ай эс
          алат жана бул мезгилде семиз адамдар салмак ташташат.
          Жан-жаныбарларга, өсүмдүктөргө, ал тургай жансыз сыяктуу көрүнгөн
          нерселерге назар салганыбызда, алар да белгилүү мөөнөт аралыгында
          өздөрүнчө «орозо» кармагандыгын байкоого болот: Биологиялык изилдөөлөр
          жырткыч жаныбарлар кар жааган кезде курсактарын тойгузуу үчүн эч нерсе
          таба алышпагандыгын көрсөткөн. Мунун натыйжасында бул жаныбарлар
          кышкысын уктап, жазга чейин орозо кармагандай болушат. Бак – дарактар
          да ушундай. Кышкысын жалбырактарын күбүп уйкуга киришет. Жаз келип,
          муздар ээригенге чейин тамырына бир тамчы суу жетпейт. Жер жылый
          баштагандан тарта ооз ачкансып, кадимкидей жанданып, бүчүр байлайт.
          Акыркы учурларда медицинада колдонула баштаган дарылоонун жаңы ыкмасы
          – өтүшүп кеткен (хроникалык) оорулар адамдын абалына жараша узун же
          кыска мөөнөттүү орозолор менен дарыланып келет. Орозонун белгилүү бир
          айда кармалышы мусулмандардын биримдигин, ынтымагын жана тынчтыгын
          сактоо өңүтүнөн өзгөчө мааниге ээ. Жамаатташа жапатырмак жасалган
          иштер оңой болорун жакшы билебиз. Анын сыңарындай, куттуу Рамазан
          айында момун-мусулмандар жарык маанай менен жапатырмак орозо кармашат.
          Саналуу гана күндөр үчүн парз кылынган орозо саналуу гана күндөрдөн
          турган өмүрүбүздүн көркүнө көрк кошот. Куттуу Рамазан айынын, мындан
          сырткары, жылдын бардык мезгилдерин басып өтүшүнүн да өзүнчө сыры бар.
          Ырас, Рамазан айы жылдын төрт мезгилиндеги ысык-суук, салкын — жылуу
          жана узун- кыска күндөрдүн баарына кезек-кезеги менен туш келет.
          Ошентип, орозо белгилүү убакыт аралыгында ырахаты жылдан бардык
          күндөрүн өзгөчө береке-кутка бөлөйт. Бул жагдай орозо кармагандар үчүн
          да зор мааниге ээ. Чыныгы мусулмандар мындан сөз менен түшүндүрүп бере
          алгыс руханий ырахат алышат жана жылдын төрт мезгилинде орозо кармоо
          менен Алла Тааланын буйругуна ар дайым даяр экендигин далилдешет. Алла
          Таала Рамазан айы жана орозо жөнүндө мындай дейт: «Рамазан айы –
          адамдарга туура жолду көрсөтүүчү жана ушул туура жолдун, жакшы менен
          жаманды ажырата билүүнүн ачык – айкын далилдери катары Куран
          түшүрүлгөн ай. Кимиңер ушул айга күбө болсоңор, (ошонуңар), орозо
          кармасын! Силердин ким (бул айда) ооруп калып, же сапарга чыкса,
          кармабай калган орозолорун башка күндөрдө кармасын! Алла силерге
          жеңилдикти гана каалайт, кыйынчылыкты каалабайт. Санды толуктагыла,
          силерди туура жолго салганы үчүн Алланы даңктагыла! Мүмкүн шүгүр
          келтирээрсиңер». (Бакара сүрөсү, 185 – аят). Алла Таала орозону Ыйык
          Курандын түшүрүлүүсүнө шүгүр келтирүү үчүн кармообузду талап кылгандай
          маани жатат бул аятта. Ал пенделерине ар дайым жеңилдикти гана
          каалагандыктан, орозону да жеңилдетип койгон. Алла Таала пенделерин эч
          качан оор абалда калтырган эмес. Аяттын акыркы бөлүгүндө орозодон
          алына турган сабакка көңүл бурулган. Тагыраак айтканда, адам баласы
          орозо кармоо аркылуу Алла Тааланын чексиз кудуретин жана эсепсиз
          жакшылыгын түшүнүп, Ага эң жогорку деңгээлде шүгүр келтиргенди
          үйрөнөт. Айтор, орозонун өзөк маани – маңызы жеп-ичүүдөн тыйылуу,
          утурумдук дүйнөнүн азгырыктарынан алыс болуу жана жүрөктү Алла
          Тааладан башка бүт нерседен тазалоо, эң жогорку руханий деңгээлге
          көтөрүлүү. Орозонун артыкчылыгы Мавляна Жалалуддин Руми (р.х) мындай
          дейт: «Адамдын эң негизги азыгы – бул, Алланын нуру, Ага кара курсакты
          ашыкча тойгузуу жарашпайт. Адамдын эң негизги азыгы – Алланын сүйүүсү
          жана парасаттуулук. Адам, негизи, руханий азыгын унутуп, кара курсагын
          гана ойлоп калгандыгы үчүн бактысыз. Ал ошон үчүн эч нерсеге тойбой
          келет. Ашыкча ышкысынан жүзү саргарып, буттары титиреп, жүрөгү
          лакылдап согот. Ал «Түбөлүктүүлүктүн, бейпиликтин азыгы кайда?!» — деп
          жаткан сыяктуу абалда болот. Алла Таала шейиттер үчүн «ырыскысы
          берилүүдө» — деди. Ал руханий азык үчүн дененин да, ооздун да кереги
          жок!» Аз тамактануунун, айрыкча, ач болуп, орозо кармоонун кайталангыс
          он пайдасы бар: 1) Ачка жүргөндө жүрөк бейпил, зээн курч абалда болуп,
          ал эми ток жүргөндө наадандык жана унутчаактык күч алат. 2) Ач
          жүргөндө жүрөк ийге келип жумшак болот да, дуба – ибадаттары
          ырахаттануу менен орундоого болот. Ал эми ток кезде жүрөк катуу болуп,
          ибадаттардан эч кандай ырахат алынбайт. 3) Ач жүргөн кезде жан дүйнө
          сергип, адам кичи пейил болсо, ал эми ток жүргөндө текеберлик, бой
          көтөрүүчүлүк, мактанчаактык сыяктуу жаман сапаттар күч алат. 4) Ач
          жүргөндө күнүмдүк нанына жетпеген кедей – кембагалдар, жарды –
          жалчылар жетим – жесирлер эске түшөт. Ток кезде булардын эч бири эске
          келбейт. 5) Ачка кезде кумарлануу, дүүлүгүү сыяктуу напсилик сезимдер
          дээрлик жоголот. Ал эми ток жүргөндө «нафсу аммара» — деген, адамды
          дайыма жамандыкка жетелеген напси күчкө толот. 6) Ач жүргөн кезде дене
          – мүчө чыйрак, сергек абалда болот. Ток кезде адамга уйку, ыкшоолук,
          жалкоолук сыяктуу сезимдер үстөмдүк кылат. 7) Ачка жүргөндө
          ибадаттарды аткаруу жеңил. Ал эми ток кезде жалкоолук күч алып,
          ибадаттарды аткаруу оор болот. 8) Аз – аздан тамактанып жүргөн кезде
          ден – соолук чын болсо, ашыкча тоюуп жүргөндө ден – соолук акырындык
          менен алсырап, ар кандай ооруларга чалдыгат. 9) Ачка жүргөндө адам
          өзүн жеңил сезсе, ток кезде ыкшоо тартып өзүн оор сезип калат. 10) Ач
          жургөн кезде кайыр – садака берүү, кызмат кылуу абдан жеңил. Бул
          жакшылыктар кыямат күндүн болуп көрбөгөндөй мээ кайнаткан ысык
          аптабында салкын көлөкө алдында болууга себепкер болот. Ал эми ток
          жүргөндө сараңдык, ысырапчылык сыяктуу жат сапаттар күч алат. Бул
          сапаттар адамды чоң жоготууга учурата тургандыгы бышык. Демек, ток
          жүрүү напсинин миң түркүн азгырык – каалоолорун жандандырса, ал эми
          ашыкча ачкалыктан алыс болуу менен бирге ач жүрүү адамдын ден –
          соолугун чындап, акылын тунук абалда сактайт. Ошентип, орозо адам
          баласынын ар тараптан чың болушуна зор салымын кошот. Бул багытта
          Азирети Пайгамбарыбыз (САВ) мындай деген: «Орозо кармагылада, (жан
          дүйнөңөрдү да, ден-соолугуңарды да) чындагыла! (Хайсами 3/179).
          Төмөнкү маселе, ашыкча тойбой, жетиштүү наар алып жүрүүнүн пайдасын
          айтып тургансыйт. Алла Таала элчилерин пайгамбарлыктын береке – кутун
          алууга орозо аркылуу даярдаган. Алар эң бийик даражага жеткен кезде
          белгилүү мөөнөт аралыгында адамдардан алыстап, асыл – сапааттарга
          бөлөнүшкөн. Ошентип, алардын жүрөктөрү Алланын вахийи кабыл алууга
          даяр абалга келген. Мисалы, Муса (а.с) Таврат түшүрүлгөнгө чейин Сина
          тоосунда кырк күн, кырк түн орозо кармаган. Ал эми Иса (а.с) дагы
          Инжилдин алгачкы сөздү укканга чейин кырк күн, кырк түн бою орозо
          кармаган. Мухаммад (САВ) босло Куран түшүрүлгөнгө чейин бир канча жыл
          бою Меккенин кыйырындагы Хира үнкүрүнө барып, күндөрүн ар кандай
          ибадаттар менен өткөргөн. Акырында, Жабраил периште Алланын алгачкы
          аяттарын алып келген. Андан бир нече жылдан кйиин Азирети
          Пайгамбарыбыз (САВ) миражга чыгып, Алла Таала менен жолуккан. Бирок,
          буга чейин бутпарастар үч жыл бою ар тараптан карым – катнашты
          үзгөндүктөн, ачкалыка жана түйшүктүн түүрүнө сабыр кылуу менен руханий
          жактан эң бийик даражага чыккан. Бул окуялардан байкалгандай, орозонун
          негизги максаты жана пайдасы адамдын жан дүйнөсүнө бакытталган.
          Андыктан, орозону ибадат кыламын деген ниетте кармоо зарыл. Тагыраак
          айтканда, орозону Алланын буйругун аткаруу үчүн гана кармоо керек.
          Эгерде ким орозону сырткы пайдалары үчүн кармаса, анда ал орозо ибадат
          болбой калат. Демек, орозо кармаганда ашказандын иштешин жакшыртуу,
          салмак таштоо сыяктуу ниеттер болбошуу кажет. Мындай орозолордо
          Алланын ыраазылыгы четте калат. Кудай Өзү сактасын. Жалгыз Алланын
          ыраазылыгы үчүн кармалган орозолордо мындай пайдалар өзүнөн – өзү
          Алланын белеги катары ыроолонот. Ошондуктан, орозо кармаган мусулман
          адам жүрөгүн напсинин түркүн азгырыктарынан алыс кармоого жан үрөөшү
          кажет. Орозонун жеп – ичпөө сыяктуу сырткы шарттарын аткаруу менен
          гана чектелбей, жана дүйнөсүн ушак, калп сөздөрдөн , көрө албастык,
          ичи – таарлык сыяктуу жат сапаттардан аруу сакташы керек. Пенделердин
          орозого бекем болуулары үчүн ага өзгөчө артыкчылык берген. Мисалы, бул
          айда бир жакшылыкка он эседен баштап, жети жүз эсеге чейин сооп
          берилет. Бирок, орозо – бул жакшылыктардан сырткары болот. Анын
          кайрымын Алла Таала Өзү эсепсиз берет. Ал орозо кармаган пенделерин
          бул дүйнөдө да, акыретте да кубантып, бейиште аларга өзгөчө сый
          көрсөтөт. Азирети Пайгамбарыбыз (САВ) бул багытта мындай деген: «Алла
          Таала мындай деди: «Адам баласынын орозодон сырткары ар бир амалы
          (ибадаты, жакшылык иштери) өзү үчүн. Ал эми орозо мен үчүн, анын
          сообун Өзүм берем». Орозо – бул калкан. Араңардан орозо кармаган адам
          ал күнү жаман сөз сүйлөбөсүн жана (эч ким менен) урушпасын. Эгерде
          кимдир бирөө ага акаарат келтирсе же тийишсе: «Мен орозомун» — десин.
          Мухаммадтын жанын чексиз кудуретинде кармап турган Алла Таалага ант
          берем! Орозо кармаган адамдын оозунун жыты Алланын алдында мисктен
          (жаанга жагымдуу атырдан) да артык! Орозо кармаган адам сүйүнө турган
          эки учур бар. Бирөөсү, ооз ачкан учуру, экинчиси Жараткан Алла
          Тааланын алдына барып, кармаган орозосунун кайрымын көргөн учуру.
          (Бухари Саум 9, Муслим сыям 163) Кыскасы, орозо рухтун эң даамдуу
          азыктарынын бири болуп эсептелет. Ал пенденин ден – соолугун чындоо
          менен бирге, жана дүйнөсүн көркүнө чыгарат. Адал нерселерди дагы өтө
          аз колдонууга көндүрүү менен рухту бышырып – жетилтет. Уруксат
          берилседа адал нерселерди өтө аз колдонгон адам шектүү нерселерден
          алыс болуп, арам нерселерге такыр жолобойт.
        </Paragraph>
      </Content>
    </Container>
  );
};

const Container = styled.div`
  max-width: 800px;
  margin: 0 auto;
`;

const Image = styled.img`
  width: 100%;
  max-height: 400px;
  object-fit: cover;
  border-radius: 8px;
  margin-bottom: 20px;
`;

const Content = styled.div`
  padding: 20px;
`;

const Title = styled.h2`
  font-size: 24px;
  font-weight: bold;
  margin-bottom: 16px;
`;

const Paragraph = styled.p`
  font-size: 16px;
  line-height: 1.6;
  color: #333; /* Цвет текста, измените по своему вкусу */
`;

export default Orozo;
