import React from 'react';
import styled from 'styled-components';
import Namaz from '../assets/ImagesGreatPersonalities/33333.jpeg';

const Shahada = () => {
  return (
    <Container>
      <Heading>Исламдын биринчи парзы - шахада келимесин айтуу</Heading>
      <ArabicText>
        أَشْهَدُ أَنْ لَا إِلٰهَ إِلاَّ اللّٰهُ وَأَشْهَدُ أَنَّ محَّدًا
        عَبْدُهُ وَرَسُولُهُ
      </ArabicText>
      <Image src={Namaz} alt="namaz" />
      <ArabicText>
        Ашхаду ан лаа илаха иллаллох ва ашхаду анна Мухаммадан абдуху ва расулух
      </ArabicText>

      <Paragraph>
        деген сөзду тил менен айтып, дил менен ырастоо. Анын терең маанисине
        күбүнүп, исламга таандык калган бул сөздүн ичине камтыганын көрөбүз.
        Курандын бардыгы шахадат келмесинин тушундурмосу жана чечмелениши деп
        айтсак, жаңылбайбыз. Себеби, Куран дин менен тавхидден турган. Муну
        тушундуруу иретинде аятта төмөнкүчүдөрдү айтат: «Бул Куран, адамдарды
        эскертилсин, Алла Жалгыз Кудай экенин билишсин жана акыл ээлери жакшылап
        акыл жуунтуу болуусу үчүн (Алла тарабынан) тушуртулган.» (Ибрахим, 52)
        Бул дийнөдө де, тигил дийнөдө де Алла Таала ыраазы болбогон бардык
        жарамдуу (салих) ишенимдери - баалуу сөздүн, аманатты ишенимдердин,
        бузукулуктын булагы болуп саналат. Алла Таала адамдарга кандай мисал
        келтиргенин көргөн жоксууну: «Жакшы сөз, жакшы дарактап жараткандын
        боюнча окулсо, тамыры (жерден) жулунган, бир даяда (орноп) жайы тапкан
        жакшы даракка окшош.» (Ибрахим, 24-26) - деген. Алланын Элчиси
        (саллаллоху алейхи васаллам) мындай дейтат: «Ар дая бирге максат –
        Алланы кындыртуу пенденин зикиридир.» (Фазаили Амал, 462) Ибни Аббас
        (Алла андан ыраазы болсун) жогорудагы аяттарды тушундурбай төмөнкүлөрдү
        айтат: «Бул жерде шахадат келмесине ишаарат бар. Тамыры момун пенденин
        сөзү менен жыргындан, бутактары болсо асмандарда. Бул себептен улам
        момундардын аткарган иш-амалдары асмандарга көтөрүлөт. Жаман сөз болсо –
        Кудайга шерик кошуу, бузукулук жана иимансыздыкты билдирген сөз. Ал
        аркылуу эч кандай иш алынбайт.» Ошондуктан: قَدْ أَفْلَحَ مَن تَزَكَّى
      </Paragraph>
    </Container>
  );
};

export default Shahada;

const Container = styled.div`
  max-width: 900px;
  margin: 0 auto;
  padding: 20px;
  text-align: center;
`;

const Heading = styled.h2`
  font-size: 1.5em;
  margin-bottom: 2rem;
`;

const ArabicText = styled.h2`
  font-size: 1.2em;
`;

const Image = styled.img`
  width: 100%;
  max-width: auto;
  height: auto;
  border-radius: 8px;
  padding: 2rem;
`;

const Paragraph = styled.p`
  font-size: 1em;
  line-height: 1.6;
  margin-top: 2rem;
`;
