import React from 'react';
import styled from 'styled-components';
import ZeketImg from '../assets/images/Three-Column-Table-Concept-Map-2.jpg';

const Zeket = () => {
  return (
    <Container>
      <Content>
        <Title>
          Исламдагы беш парздын бири болгон Зекеттин тартиптери жана өлчөмү
        </Title>
        <Image src={ZeketImg} alt="Zeket" />
        <Text>
          <b>
            Исламдагы беш парздын бири болгон Зекеттин тартиптери жана өлчөмү
            Коом Алла Таала ыйык Куранда, Пайгамбарыбыз Мухаммад (с.а.в) өзүнүн
            хадистеринде, колунда бар кишиге мусулмандарга зекет берүүнү
            буюрган. Кыргызстан мусулмандарынын Аалымдар Кеңеши жана Кыргызстан
            мусулмандарынын Дин Башкармалыгы өлкө боюнча 2020-жылга карата
            зекеттин баасын бекитти.{' '}
          </b>{' '}
          <br />
          <br />{' '}
          <b>
            {' '}
            1. Ар бир мусулман пенденин байлыгы Ислам шариятында көрсөтүлгөндөй
            зекет (нисабына) өлчөмүнө жетип, колунда кармалып турганына бир жыл
            толсо, ал мусулманга зекет берүү парз болот. <br />
            <br />
          </b>{' '}
          <b>
            2. Зекетке ошол байлыктын кырктан бир (40/1) бөлүгү башкача айтканда
            2.5% берилет.{' '}
          </b>
          <br />
          <br />{' '}
          <b>
            {' '}
            3. Зекеттин (нисабы) өлчөмү алтын эсебинде 20 (мискалга) алтынга
            барабар. 20 мискал орто эсеп менен 85 грамм алтынга туура келет. Ал
            эми күмүштүн өлчөмүнө караганда 612,36 граммга туура келет.
            Кыргызстанда 1 грамм (жасалга болбогон-лом) алтындын орточо баасы
            2280 сом. Ал эми 1 грамм уюутулган күмүштүн баасы 36 сом.
            Жыйынтыгында: Алтын баасында эсептегенде: 85 грамм алтынды
            (585-проба менен) 2280 сомдон эсептегенде 193 800 сом болуп, анын
            кырктан бири 4845 сом. (Эгер АКШ доллары менен эсептегенде 2307
            доллар болуп, анын кырктан бири 55 доллар). Күмүштүн баасы менен
            эсептегенде: 612,36 грамм күмүштү (орто эсеп менен) 36 сомдон
            эсептегенде 22 044 сом болуп, анын кырктан бири 551 сом. (Эгер АКШ
            доллары менен эсептегенде 316 доллар болуп, анын кырктан бири 8
            доллар). Жогоруда аталаган зекет төрт нерседен берилет: Алтындан,
            күмүштөн, нак акчадан, товарлардан (соода-сатык ниетинде сатып
            алынган буюмдар).
          </b>
        </Text>
      </Content>
    </Container>
  );
};

const Container = styled.div`
  max-width: 800px;
  margin: 0 auto;
  text-align: center;
`;

const Content = styled.div`
  padding: 20px;
`;

const Title = styled.h2`
  font-size: 24px;
  font-weight: bold;
  margin-bottom: 16px;
`;

const Image = styled.img`
  width: 100%;
  max-height: 450px;
  object-fit: cover;
  border-radius: 8px;
  margin-bottom: 2rem;
`;

const Text = styled.div`
  font-size: 16px;
  line-height: 1.6;
  color: #333;
`;

export default Zeket;
