import React from 'react';
import { Container, Typography, styled } from '@mui/material';

const Akyret = () => {
  return (
    <Container>
      <StyledBannerText>
        <h2>Кимди сүйсөң акыретте аны менен бирге болосуң</h2>
      </StyledBannerText>
      <StyledTypography>
        <b>
          Дин улуктары менен бирге болуш үчүн аларды сүйүү жеткиликтүү. Бирок,
          эч бир ибадат кылбаган жана эч бир күнөөдөн сактанбаган адам улууларды
          эч качан сүйө албайт. Сүйгөн адам сүйүктүүсүнө баш ийет. Алар сыяктуу
          боло албайбыз, бирок, колубуздан келгенин кылуубуз шарт. Диндин буйрук
          жана тыюу салган нерселерине моюн сунбастан бир гана сүйөм деп айтуу
          жалган болот. Себеби, анда гаухар жок. Сүйүү жогорудан келет. Улуулар
          аны сүйбөсө, ал адам улууларды сүйө албайт. Асхабы кирамдан биринин
          өтө кайгырып турганын көргөн Пайгамбарыбыз "саллаллаху алейхи ва
          саллам” сурайт: - Мынча эмнеге кайгырып жатасың? Ал адам айтат: - Йа,
          Расулуллах, сиздин айткандарыңызды толук аткара албай жатабыз,
          абалыбыз кандай болот. Ушундайча кайгы азап ичинде турганда
          Пайгамбарыбыз ошол жерде бир сүйүнчүнү билдирет: "Эль меру меа мен
          эхаббе” Сен дейт, кайгырба, бул жерде кимди сүйсөң акыретте аны менен
          бирге болосуң. Демек, ким экендигибиз эмес кимди сүйгөндүгүбүз
          маанилүү.
        </b>
      </StyledTypography>
    </Container>
  );
};

export default Akyret;

const StyledBannerText = styled('div')({
  fontSize: '2rem',
  textAlign: 'center',
  padding: '1rem',
});

const StyledTypography = styled(Typography)({
  lineHeight: '3',
  textAlign: 'center',
  wordSpacing: '3px',
  letterSpacing: '1',
});
