import { Container, Typography } from '@mui/material';
import React from 'react';
import styled from 'styled-components';

const ImamAzzam = () => {
  return (
    <Container>
      <StyledBannerText>
        <h2>Бир алма жана Имам Азамдын атасы</h2>
      </StyledBannerText>
      <StyledTypography>
        Шемседдин Сивасинин Менакых-и Имам Азам аттуу эмгегинде мындай жазылган:
        Имам Азамдын атасы Сабит (рахметуллахи алейх) кичине жашынан тарта
        ахлагы таза, такыбаа зат болгон. Жүзү абдан нурдуу болуп, диндарлыгы
        жана илими өтө жогору болгон. Бир күнү бир дайранын жээгинде даарат алып
        жаткан эле. Сууда бир алманы көрөт. Даарат алып болуп, сууда чирип кете
        турчу бул алманы алып жейт. Бирок, түкүрүгүндө кан көрөт. Бул убакка
        чейин мындай абалга туш келбегендиктен түкүрүгүндөгү кандын ушул жеген
        алмадан улам болгондугун божомолдойт. Жегенине өкүнөт. Алманын ээсин
        таап, кечирим сурап ыраазылыгын алуу үчүн дайраны бойлоп басат. Акыры
        барып жеген алмага окшогон алма бакка туш келет. Ээсин сурайт. Бул
        заттын абдан жоомарт, жакшылыктуу адам экендигин, жада калса, бактагы
        алмаларды түгөл жыйнап алып кетсе да эч нерсе дебей тургандыгын, бир
        алма үчүн убара тартуунун мааниси жоктугун айтышат. Буга карабастан
        алманын ээсин табат, окуяны түшүндүрүп же акчасын алуусун, же акысын
        адал кылып, ыраазы болуусун суранат. Алма бактын ээси бул жаш жигиттин
        абалын карап, такыбаалыгынын чын-жалганын билиш үчүн мындай дейт: -
        Жеген алмаң үчүн эмне бересиң? - Алтын-күмүш, эмнем болсо берейин. - Мен
        алтын-күмүш каалабайм, бирок, эгер кыяматта сага доочу болуумду
        каалабасаң сага бир сунушум бар, аны кабыл кылышың керек. - Сунушуң
        эмне? - Орундай турган болсоң айтайын… - Исламиятка туура келсе орундай
        алам. - Сокур, дүлөй, тилсиз жана колу-буту шал болгон бир кызым бар,
        аны менен үйлөнүүгө макулдук берсең ошондо гана бул алманы сага адал
        кылам. Сабит хазреттери акыретке кул акысы менен кетпеш үчүн бул сунушту
        кабыл кылат. Нике той даярдыктары көрүлөт. Сабит хазреттери биринчи түнү
        бөлмөгө киргени менен чыкканы бир болот. Дароо кайын атасына жүгүрүп
        барып: «Ата, бул жерде бир жаңылыштык бар сыяктуу, бөлмөдө сиз айткан
        сыпаттагы кыз эмес таптакыр башка бири отурат!» - дейт. Кайын атасы
        күлүмсүрөп: «Балам, ал менин кызым, сага адал болгон кыз. Мен сага аны
        сокур деп айткан болсом, ал эч качан арам нерсе көргөн эмес. Дүлөй деген
        болсом, ал эч качан арам нерсе уккан эмес. Тилсиз деген болсом, ал эч
        качан арам нерселерди сүйлөгөн эмес. Шал деген болсом, ал эч качан арам
        жерлерге барган эмес. Бар эми адал жубайыңдын жанына бар, Аллаху таала
        мубарек жана бактылуу кылсын.» Мына ушул үйлөнүүдөн, б.а., ушундай
        эне-атадан Имам Азам Абу Ханифа дүнүйөгө келген.
      </StyledTypography>
    </Container>
  );
};

export default ImamAzzam;

const StyledBannerText = styled('div')({
  fontSize: '2rem',
  textAlign: 'center',
  padding: '1rem',
});

const StyledTypography = styled(Typography)({
  lineHeight: '1.6',
  textAlign: 'center',
});
