import { Container, Typography } from '@mui/material';
import React from 'react';

const Uzunomur = () => {
  return (
    <Container>
      <div>
        <h2>Алар там да салабы?</h2>
      </div>
      <Typography>
        Нух алейхиссаламдын заманында адамдар узун өмүрлүү болушкан экен. 800 –
        1000 жылга чейин жашашчу экен. Бир аялдын баласы кайтыш болот. Аял аябай
        ыйлайт. Кошуна аялдардын бири ага деген экен: - Эмне мынчалык ыйлайсың,
        Аллаху тааланын тагдыры ушундай экен да. - Албетте ушундай, мен ага
        ыйлаган жокмун. - Анда эмнеге ыйлап жатасың? - Балам көп күн көрө албай
        калды деп, энелик мээримимен улам ыйлап жатам. - Балаң канча жашта эле?
        - 275 жашта эле. - Макул, бирок, сен буга ыйлап турасың да, акыр заманда
        келе турган үммөт эмне кылсын, өмүрлөрү 50-60 жыл гана болот. - Чын эле
        айтып жатасыңбы? - Албетте. - Ооо Кудай! Алар там да салабы? - Албетте,
        бир канчасын салат экен. Мен алардын ордунда болсом чатырымдын бир
        казыгын болсо да алмаштырмак эмесмин.
      </Typography>
    </Container>
  );
};

export default Uzunomur;
