import React from 'react';
import styled from 'styled-components';
import AbdurrakhmanibnAufImg from '../assets/images/Abdurakhmanibnaufimg.png';

const AbdurrakhmanibnAuf = () => {
  return (
    <Container>
      <Title>Абдуррахман Ибн Ауф (радыяллаху анх)</Title>
      <Image src={AbdurrakhmanibnAufImg} alt="abdurakhman" />
      <Paragraph>
        Жаннат менен сүйүнчүлөнгөн он сахабанын бири. Абдуррахман бин Авф соода
        менен алектенчү. Ушул себептен улам соода кылууга ар кайсы жерлерге
        барчу. Мындайча баяндайт: Пайгамбарыбыз алейхиссаламга пайгамбардык
        буйругу билдирилгенге чейин бир жыл мурун соода үчүн Йеменге барганымда,
        Аскелан бин Авакир-ул-Химеринин коногу болдум эле. Ал зат абдан карыган
        эле жана ал жерге ар барганымда анын коногу болчу элем. Ал дагы менден
        Меккеден кабар сурап, мындай дечү: - Араңарда өзү тууралуу жөнүндө кабар
        жана сөз болгон бир зат чыктыбы? Диниңерге байланыштуу силерге каршы
        болгон бир адам барбы? Мен болсо дайыма "жок” деп айтчумун.{' '}
      </Paragraph>
      <br />
      <br />
      <Paragraph>
        Ага китеп түшүрдү Акыры, Расулуллах алейхиссаламга пайгамбардык
        билдирилип, Ислам динин адамдарга жашыруун жеткире баштаган жылы эле.
        Дагы Йеменге барып, ошол эле заттын коногу болгонумда ал мага мындай
        деди: - Мен сени соодадан да жакшыраак бир куш кабар менен
        сүйүнчүлөйүнбү? - Ооба, сүйүнчүлөңүз. - Күмөнсүз, Аллах сенин коомуңан
        Андан ыраазы болгон, тандап алган бир пайгамбарды жиберди жана Ага Китеп
        да түшүрдү. Ал адамдарды буттарга сыйынуудан кайтарат жана Исламга
        чакырат. Ал хакты буюрат, ишке ашырат, жаңылыштан кайтарат жана жок
        кылат. Ал Хашим уулдарынан. Силер Анын таякелерисиңер. Тезирээк кайт!
        Барып, Ага жардамчы бол! Аны тастыкта жана бул бейттерди Ага алып бар!
        Йемендик карыянын айткан бейттерин жаттап, кайра Мекке-и мукаррамага
        кайтып барып, Хазрети Абу Бакрга жолуктум. Мен ага йемендик карыянын
        айткандарын кабарладым. Абу Бакр айтты: - Ал киши - Абдуллахтын уулу
        Мухаммед алейхиссалам. Аллаху таала Аны адамдарга пайгамбар кылып
        жиберди. Дароо Ага барып, ыйман келтир! Мен дароо Расулуллахтын үйүнө
        бардым. Расулуллах алейхиссалам мени көргөндө күлүмсүрөп сурады: - Эй,
        Абдурахман! Кандай кабар алып келүүдөсүң? - Йа, Мухаммед! Муну кандай
        түшүнүүгө болот? - Ал адамдын сен аркылуу мага аманат кылып жиберген
        нерсени алып кел, бер. Аны мага жөнөткөн адамдын Химярдын уулдарынын
        момундарынын үстөмдөрүнөн экендиги талашсыз.
      </Paragraph>
      <br />
      <br />
      <Paragraph>
        Сени ыйлаткан нерсе эмне? Абдуррахман бин Авф хазреттери Расулуллах
        акыретке көчкөндөн кийин Аны менен өткөргөн күндөрүн эстеп дайыма
        ыйлачу. Анын сукбаттарынан ажырап калгандан кийин ага дүнүйөнүн эч
        кандай мааниси калбаганын айтчу. Навфал бин Ийас хазреттери айтат:
        Абдурахман бин Авф хазреттери бир күнү бизди үйүнө алып барды. Ал бизге
        идиште даамдуу тамактарды сунду. Тамакты алдыбызга койгондо ыйлай
        баштады. Ал ыйлаганда биз да ыйлай баштадык. Бирок, эмнеге ыйлаганыбызды
        билбей калдык. Мен сурадым: - Эй, Абдурахман! Сени мынча ыйлаткан нерсе
        эмне? - Биз ушунча көп нематтардын ичиндебиз. Расулуллах кайтыш болду.
        Бирок, Ал жана үй-бүлөсү арпа нанынан да бир жолу болсо дагы тойгончо
        жеген жок. Биз ушул жегендерибиздин шүгүрүн кантит орундайбыз? Мына ошон
        үчүн ыйлап жатам. Абдуррахман бин Авф Хижраттын 6-жылы Расулуллах
        алейхиссалам тарабынан Келб уруусун Исламга чакыруу үчүн
        Думет-ул-Женделге жиберилген 700 кишилик кошуундун кол башчысы болуп
        дайындалды. Думет-ул-Жендел Табук калаасына жакын жерде болуп, ири
        жарманке жана соода борбору эле. Расулуллах алейхиссалам Абдурахман бин
        Авфты жанына чакырып мындай деди: - Даярдан! Сени бүгүн же эртең таңга
        маал Кудай кааласа аскер бөлүктүн башында көрөм.{' '}
      </Paragraph>
    </Container>
  );
};

export default AbdurrakhmanibnAuf;

const Paragraph = styled.p`
  font-size: 16px;
  line-height: 1.6;
  color: #333;
`;

const Container = styled.div`
  text-align: center;
`;

const Title = styled.h1`
  font-size: 24px;
  color: #333;
  margin-bottom: 20px;
`;

const Image = styled.img`
  max-width: 500px;
  height: auto;
  border-radius: 8px;
  margin-bottom: 20px;
`;
