import React from 'react';
import AbuBakrSyddykImg from '../assets/images/АбуБакрСыддык.gif';
import styled from 'styled-components';
const AbuBakr = () => {
  return (
    <Container>
      <Title>Абу Бакр Сыддык (радыяллаху анх)</Title>
      <Image src={AbuBakrSyddykImg} alt="khalif" />
      <Paragraph>
        Абу Бакр Сыддык – ашара-и мубашшаранын эң алгачкысы. Пайгамбарлардан
        кийин адамзат ичинде эң улуусу. Бардык согуштарга катышты. Аяттар менен
        макталды. Ал Курани каримди алгачкы жолу китеп ирээтинде жыйнатты.
        Хижраттын он үчүнчү жылы, азыркы жыл саноо болюнча 634-жылы Жамазил-ахир
        айынын 28инде шейшемби күнү түнү 63 жашында кайтыш болду. Расулуллахтын
        жанына жерге коюлган. Ак жуумал, көздөрү чуңкурча, жылуу жүздүү, бетинде
        сакалы сейрек эле.
      </Paragraph>
      <List>
        <ListItem>
          Хадиси шарифтерде мындай билдирилет: "Абу Бакр Сыддык – Адамзаттын эң
          жогоркусу жана эң жакшысы. Бирок, ал пайгамбар эмес”.
        </ListItem>
        <ListItem>
          "Абу Бакр - Аллаху тааланын оттон азат кылган адамы”.
        </ListItem>
        <ListItem>
          "Пайгамбарлардан башка Абу Бакрдан да башка жогорку даражалуу адамдын
          үстүнө күн чыккан эмес”.
        </ListItem>
        <ListItem>
          "Мага эч ким мажлиси жана мал-дүйнөсү жагынан Абу Бакрдай пайдалуу
          болгон эмес. Эгер Раббимден башкасы менен дос боло турган болсом Абу
          Бакр менен дос болор элем”.
        </ListItem>
        <ListItem>
          "Үммөтүмдүн ичинен эң биринчи болуп Бейишке Абу Бакр кирет”. "Абу
          Бакрди сүйүү жана ага мактоо айтуу - үммөтүмдүн баарына важиб”.
        </ListItem>
        <ListItem>
          "Кыямат күнү адамдардын бардыгы суракка тартылат. Бир гана Абу Бакр
          суракка тартылбайт”.
        </ListItem>
        <ListItem>
          Бир хадисте: "Үч жүз алтымыш жакшы мүнөз бар. Аллаху таала кааласа бир
          кулуна ошол мүнөздөрдүн баарын берет. Ошол мүнөзүнө байланыштуу аны
          Жаннатка киргизет”, - деп айтылганда, Абу Бакр: "Эй, Расулуллах! Ошол
          мүнөздөрдүн бирөө менде барбы?” - деп сураганда, "Ооба, ал мүнөздөрдүн
          баары сенде бар”, - деп жооп берет Пайгамбарыбыз.
        </ListItem>
        <ListItem>
          Бир күнү Расулуллах Абу Бакр менен Умарды көрүп: "Бул экөө менин көзүм
          менен кулагым”, - деди.Бир күнү Расулуллах Абу Бакр менен Умарды
          көрүп: "Бул экөө менин көзүм менен кулагым”, - деди.
        </ListItem>
        <ListItem>
          Ал экөөнө: "Мени силер экөөңөр менен кубаттандырган Аллаху таалага
          хамд (моктоо) болсун”, - деди. Ошондой эле, бир хадиси шарифте:
          "Экөөңөр келишкен нерселерде силерден айрылбайм”, - делген.
        </ListItem>
        <ListItem>
          Дагы биринде: "Ар бир пайгамбардын жакын досу болот. Менин жакын досум
          Абу Бакр”, "Ар бир пайгамбардын үммөтү арасында өзгөчө сүйгөн адамдары
          болот. Менин тандоом – Абу Бакр жана Умар”, "Үммөтүмдөн ла илаха
          иллаллах келимесин айтууну талап кылганым сыяктуу Абу Бакр жана Умарды
          сүйүшүңөрдү да талап кыламын”, "Абу Бакр жана Умарды сүйүү – ыймандан.
          Аларга душман болуу - куфур”, - деген хадиси шарифтер бар.
        </ListItem>
        <ListItem>
          Бир хадисте: "Абу Бакрдын ыйманы бүткүл адамзаттын ыйманынын
          топтомунан да күчтүү”, - деп билдирилген.
        </ListItem>
      </List>
    </Container>
  );
};

export default AbuBakr;

const Paragraph = styled.p`
  font-size: 16px;
  line-height: 1.6;
  color: #333;
`;

const Container = styled.div`
  text-align: center;
`;

const Title = styled.h1`
  font-size: 24px;
  color: #333;
  margin-bottom: 20px;
`;

const Image = styled.img`
  max-width: 100%;
  height: auto;
  border-radius: 8px;
  margin-bottom: 20px;
`;

const List = styled.ul`
  list-style-type: none;
  padding: 0;
  margin: 0;
  text-align: left;
`;

const ListItem = styled.li`
  font-size: 14px;
  line-height: 1.4;
  color: #555;
  margin-bottom: 10px;
`;
