import styled from 'styled-components';
import ImgAbuUbaidah from '../assets/images/абуубайдара.png';

const AbuUbaidah = () => {
  return (
    <Container>
      <Title>Абу Убайда Ибн Жаррах</Title>
      <h3>Бейиш менен сүйүнчүлөнгөн үммөттүн aмини (ишенимдүүсү).</h3>
      <Image src={ImgAbuUbaidah} alt="ImgAbuUbaidah" />

      <Paragraph>
        Араптардын арасында сейрек сабаттуу кишилерден болгон Абу Убайда бин
        Жаррах жана достору Осман бин Мазъун, Убайда бин Харис, Абдуррахман бин
        Авф, Абу Салама Хазрети Абу Бакр аркылуу Расулуллахтын алдында мусулман
        болушту. Хазрети Абу Убайда Хазрети Абу Бакр аркылуу ыйман
        келтиргендердин онунчусу. Ыйман келтиргенде 31 жашта эле. Ошол күндөн
        тартып өлгөнгө чейин мал-мүлкү, кызмат орду жана өмүрү менен Исламды
        жайылтуу үчүн аракет кылды.{' '}
      </Paragraph>
      <List>
        <ListItem>
          Хадиси шарифтерде мындай билдирилет: "Абу Бакр Сыддык – Адамзаттын эң
          жогоркусу жана эң жакшысы. Бирок, ал пайгамбар эмес”.
        </ListItem>
      </List>
      <Title>Эки жолу хижрат кылды</Title>
      <List>
        <ListItem>
          Бадр казатында анын атасы да душмандын катарында эле. Бул казатка
          периштелер да катышып, адам кейпинде колдорунда кылычтары менен
          капырлар менен согушушкан эле. Бул согушта Абу Убайда чоң эрдик
          көрсөткөн эле.
        </ListItem>
      </List>
      <List>
        <ListItem>
          Хазрети Убайда Ухуд согушунда да чоң эрдик көрсөттү. Пайгамбарыбыз
          алейхиссалам Абу Убайда менен Саад бин Абу Ваккас хазреттерин алдыңкы
          сапта согушкандарга командачы кылып дайындады. Алар капырларды
          борбордо турган сүйүктүү Пайгамбарыбызга жакындатпоо үчүн болгон
          күч-аракетин жумшап согушушчу.
        </ListItem>
      </List>
      <List>
        <ListItem>
          Хазрети Убайда Ухуд согушунда да чоң эрдик көрсөттү. Пайгамбарыбыз
          алейхиссалам Абу Убайда менен Саад бин Абу Ваккас хазреттерин алдыңкы
          сапта согушкандарга командачы кылып дайындады. Алар капырларды
          борбордо турган сүйүктүү Пайгамбарыбызга жакындатпоо үчүн болгон
          күч-аракетин жумшап согушушчу.
        </ListItem>
      </List>
      <List>
        <ListItem>
          Көптөгөн сахабалары согушуп шейит болушту. Душман артка чегинген эле.
          Жеңиш жакындап калды. Жеңиш кубанычы менен жайларын таштап кеткен
          кутман сахабалар турган жерден душмандын атчан аскерлери чабуулга
          өтүп, Пайгамбарыбыз алейхиссаламга жакындап калышты.
        </ListItem>
      </List>
      <List>
        <ListItem>
          Ибни Камия деген мүшрик Расулуллахтын куттуу башына кылыч менен чаап,
          туулганын темири анын куттуу жаагына кадалды.
        </ListItem>
      </List>
    </Container>
  );
};

export default AbuUbaidah;

const Paragraph = styled.p`
  font-size: 16px;
  line-height: 1.6;
  color: #333;
`;

const Container = styled.div`
  text-align: center;
`;

const Title = styled.h1`
  font-size: 24px;
  color: #333;
  margin-bottom: 20px;
`;

const Image = styled.img`
  max-width: 500px;
  height: auto;
  border-radius: 8px;
  margin-bottom: 20px;
`;

const List = styled.ul`
  list-style-type: none;
  padding: 0;
  margin: 0;
  text-align: left;
`;

const ListItem = styled.li`
  font-size: 14px;
  line-height: 1.4;
  color: #555;
  margin-bottom: 10px;
`;
