import React from 'react';
import styled from 'styled-components';
import AbuVakkasRaImg from '../assets/images/abuvakkasra.jpeg';
const AbuVakkass = () => {
  return (
    <div>
      <Container>
        <Title>Ислам тарыхы</Title>
        <h3>Азирети Саъд бин Абу Ваккас (р.а.).</h3>
        <Image src={AbuVakkasRaImg} alt="ImgAbuUbaidah" />

        <Paragraph>
          Азирети Саъд бин Абу Ваккас (р.а.) Пайгамбарыбыз (с.а.в.) бул дүйнөдө
          эле Жаннатка кирүү сүйүнчүсүн угузган сахабалардан эле. Анын (р.а.)
          аты Саъд бин Маалик, Курайш уруусунан болчу. Саъд (р.а.) он жети
          жашында мусулман болуп ислам динине биринчи киргендердин жетинчиси
          болгон. Бирок, Алла Таала жолунда жаа аткан эң биринчи адам. Жана анын
          дубалары дайыма кабыл болот эле. «Бадр» жана «Ухуд» согуштарында андан
          башка бардык казаттарда Пайгамбарыбыз (с.а.в.) менен биргеликте
          катышкан эле. Алла жолунда көптөгөн кыйынчылыктарды көргөн. Азирети
          Саъд (р.а.) өзү мындай деп баяндайт: «Биз эч кандай нерсебиз жок
          абалда Пайгамбарыбызды (с.а.в.) жандап жүрөт элек. Бизде жегенге бир
          ачуу дарактын мөмөсү жана анын жалбырагынан башка эч нерсе жок болот
          эле».
        </Paragraph>
        <Paragraph>
          Пайгамбарыбыз (с.а.в.) дын мужизасы Дудуктун сакайып кетүүсү
          Пайгамбарыбыздын (с.а.в.) алдына бир баланы алып келишти. Ал бала
          тубаса дудук эле. Ал (с.а.в.) баладан: «Кана менин ким экенимди
          айтчы»-деп сурады. Ал бала: «Сиз (с.а.в.) Алла Тааланын
          пайгамбарысыз»-деп жооп берди (ошол убакыттан баштап сүйлөй баштады).
          (Байхаки Далааилун Нубувва 2311)
        </Paragraph>
        <Paragraph>
          Бир фарз тууралуу Күйөөсүнүн мурасындагы аялынын үлүшү Алла Таала
          Куранда айтат: «Жана силер калтырган мурастан аялдарыңарга төрттөн
          бири тийет силерден бала калбаган учурда. Эгер силерден бала калган
          болсо, силердин осуятыңарды аткаргандан кийин жана карызыңарды
          төлөгөндөн кийин аялдарыңарга силер калтырган мурастан сегизден бири
          тийет». (Ниса сүрөөсү; 12) Пайдасы: Күйөөсү кайтыш болгондон кийин
          эгер анын эч кандай баласы жок болсо, анда аялына күйөөсүнөн калган
          мүлктүн төрттөн бири берилет. Жана эгер анын баласы болсо, анда аялына
          ал мүлктүн сегизден бир бөлүгүн берүү зарыл.
        </Paragraph>
        <Paragraph>
          Бир сүннөт тууралуу Тамактануу алдындагы дуба Качан тамак жеп
          баштаганыңарда бул дубаны окугула: «باسم الله». (Бухари 5376 Абу
          Салама (р.а.). Пайдасы: эгер тамактын башында дубаны окууну унутуп
          калсаңар, анда бул дубаны окугула: «باسم الله أوّله و اخره» Котормосу:
          Башында жана аягында Алла Тааланын атын атап жеймин. (Абу Дауд 3767
          Айша (р.а.))
        </Paragraph>
        <List>
          <ListItem>
            Бир өзгөчө амалдын пазилети Уктаарда «Каафируун» сүрөөсүн окуу
            Кимде-ким кечинде уктаар мезгилде «قل يا أيّها الكافرون» сүрөсүн
            (толук) окуса, анда ал ширктен таза болот. (Тирмизи 3403 Фарва бин
            Науфал (р.а.).
          </ListItem>
        </List>
        <Paragraph>
          Бир күнөө тууралуу Сүткорго каршы согуш жарыялоо Алла Таала Куранда
          айтат: «Эгер силер (сүткорлук кылуудан) тыйылбасаңар, Алла жана Анын
          элчиси тарабынан (силерге каршы жарыялана турган) согушту билип
          койгула. (Ошондуктан ар бир мусулманга сүткөрлуктан сактануу керек)».
          (Бакара сүрөөсү; 279)
        </Paragraph>
        <Paragraph>
          {' '}
          Дүйнө тууралуу Дүйнөгө караганда акыреттин үйү жакшыраак Алла Таала
          Куранда айтат: «Дүйнө жашоосу (тез өтүп кетүүчү) оюн-тамашадан башка
          эч нерсе эмес. Такыба кишилер үчүн Акырет жашоосу жакшы. Акылыңарды
          иштетпейсиңерби?!». (Анъаам сүрөөсү; 32)
        </Paragraph>
        <Paragraph>
          Акырет тууралуу Бейиштеги эң сыйлуу адам Пайгамбарыбыз (с.а.в.) айтты:
          «Бейиште эртең менен жана кечинде Алла Тааланын жүзүн көрүп турган эң
          сыйлуу адам болот». (Тирмизи 2553 ибну Умар (р.а.))
        </Paragraph>
        <Paragraph>
          Акырет тууралуу Бейиштеги эң сыйлуу адам Пайгамбарыбыз (с.а.в.) айтты:
          «Бейиште эртең менен жана кечинде Алла Тааланын жүзүн көрүп турган эң
          сыйлуу адам болот». (Тирмизи 2553 ибну Умар (р.а.))
        </Paragraph>
        <Paragraph>
          Пайгамбарыбыздын (с.а.в.) насааты Пайгамбарыбыз (с.а.в.) айтты: «Силер
          жолдун жээгине олтурбагыла! Сахабалар айтып калышты: «Оо, Алланын
          Элчиси! Биздин жолдун жээгине олтуруубуз кээде зарыл болуп калат».
          Анда Пайгамбарыбыз (с.а.в.) «Макул, олтургула! Бирок жолдун акысын
          толук бергиле»-деп, айтты. Сахабалар «Жолдун акысы кандай»-деп
          сураганда, Пайгамбарыбыз (с.а.в.): «Көздү ылдый кылуу, зыяндуу
          нерселерди жолдон четке алып коюу жана саламга жооп берүү, жакшылыкка
          үндөп жана адамдарды жамандыктан кайтаруу»-деп жооп берди. (Абу Дауд
          4815 Абу Саъид Худрий (р.а.))
        </Paragraph>
      </Container>
    </div>
  );
};

export default AbuVakkass;

const Paragraph = styled.p`
  font-size: 16px;
  line-height: 1.6;
  color: #333;
`;

const Container = styled.div`
  text-align: center;
`;

const Title = styled.h1`
  font-size: 24px;
  color: #333;
  margin-bottom: 20px;
`;

const Image = styled.img`
  max-width: 500px;
  height: auto;
  border-radius: 8px;
  margin-bottom: 20px;
`;

const List = styled.ul`
  list-style-type: none;
  padding: 0;
  margin: 0;
  text-align: left;
`;

const ListItem = styled.li`
  font-size: 14px;
  line-height: 1.4;
  color: #555;
  margin-bottom: 10px;
`;
