import React from 'react';
import AliIbnAbutTalibImg from '../assets/images/274px-Rashidun_Caliph_Ali_ibn_Abi_Talib_-_علي_بن_أبي_طالب.svg.png';
import styled from 'styled-components';
import AliIbnAbutTalibKaabaImg from '../assets/images/kaaba_1729_1522755208.jpeg';

const AliIbnAbuTalib = () => {
  return (
    <Container>
      <Title>Али бин Абу Талиб (радыяллаху анхy)</Title>
      <Image src={AliIbnAbutTalibImg} alt="ali" />
      <Paragraph>
        Ал – Расулуллахтын аталаш агасы Абу Талибдин уулу. Ислам халифаларынын
        жана Бейиш менен сүйүнчүлөнгөн он адамдын төртүнчүсү. Расулуллахтын
        күйөө баласы. Ахли бейттин биринчиси. Хижраттан 23 жыл мурда Меккеде
        туулган. Он жашында ыйман келтирген. Бардык согуштарда эрдик көрсөткөн.
        Бир гана Ухуд согушунда он алты жеринен жаракат алган эле. 35-жылы
        Зулхижжа айында халифа болгон. Х. 40-жылы (м.660) 17-Рамазанда Жума күнү
        таңкы намазга бара жатканда Абдуррахман ибн Мулжам деген харижит
        сектасынын мүчөсү тарабынан кылыч менен маңдайына урулуп, шейит
        кылынган. Куфада, б.а., азыр Нажаф деп аталган шаарда жерге коюлган.
        Буудай өңдүү, узун бойлуу, жылуу жүздүү чоң кара көздүү, кең денелүү,
        келбеттүү киши эле. Соңку убакыттарда чачы менен сакалы аппак куу болуп
        агарып кеткен эле. Олуялардын улуусу, олуялык жолунун жол башчысы.
        Бардык тарикаттарда олуялыктын марифаты жана фейзи, б.а., руханий илими
        Хазрети Алиден келет.
      </Paragraph>
      <List>
        <ListItem>
          1- Алинин (Аллах андан ыраазы болсун) жарык дүйнөгө келиши.
          Окумуштуулардын Алинин кайсы убакта төрөлгөнүнө карата бир нече
          пикирдери бар. Бир тарап, Али пайгамбарлык миссия баштала электен
          15-16 жыл мурун төрөлгөн дешсе, башкалары 10 жыл мурун төрөлгөн
          дешкен. Дагы бир тарап 5 жыл мурун жарык дүйнөгө келгенин айгинелешет.
          Көптөрү Алинин Каабанын ичинде төрөлгөнүн өзгөчө белгилешет.
        </ListItem>
        <ListItem>
          2- Али (Аллах андан ыраазы болсун) менен Пайгамбарыбыздын (Алланын ага
          салам-салаваттары болсун) жакын туугандык байланышы бар.
          Пайгамбарыбыз(Алланын ага салам-салаваттары болсун) менен Али (Аллах
          андан ыраазы болсун) Абд-аль-Мутталиб ибн Хашимдин неберелери эле.
          Алинин атасы Абу Талиб менен Пайгамбарыбыздын атасы Абдаллах бир
          туугандардан болушчу. Абд-аль-Мутталиб өз мезгилинин кадыр-барктуу
          адамдарынан эле. Анткени ал Меккеге келген ажылардын тамак-аш жагын
          тейлеген. Ал балдарын адилеттүү болууга үндөп, адамдык асыл сапаттар
          менен тарбиялаган.
        </ListItem>
        <ListItem>
          3- Алинин (Аллах андан ыраазы болсун) лакап аттары. Али жарык дүйнөгө
          келгенде, ага апасы тарабынан Асад (арстан) деген ат берилген. Мындай
          атты анын апасы өзүнүн атасы Асад ибн Хашимдин урматына койгон. Алиге
          ат коюлуп жаткан убакта Абу Талиб алардын жанында болгон эмес. Кийин
          келгенде ага Асад деген ат жакпай, уулуна Али деп ат койгон. Ошондой
          эле, Алинин Пайгамбарыбыз койгон Абу Тураб (чаңдын атасы) деген да
          лакап аты болгон. Алинин өзүнө бул ат абдан жакчу. Бул окуя мындай:
          Али жубайы Фатима менен бир аз таарыныша кетишет. Пайгамбарыбыз
          Фатимадан муну угуп, Алинин кайда экенин билип келүүгө бир кишини
          жөнөтөт. Ал Алинин мечитте уктап жатканын айтат. Пайгамбарыбыз мечитке
          барып, Алинин үстүндөгү жамынгычы ачылып, а Али өзү чаңда жатып
          калганын көрүп, Алла Элчиси Алинин үстүндөгү чаңды күүп, “Тур, Абу
          Тураб” (Чаңдын атасы) деп ойготот. Ошондон кийин аны Абу Тураб деп да
          атап калышкан.
        </ListItem>
        <ListItem>
          4- Алинин (Аллах андан ыраазы болсун) сырткы турпаты. Алинин бою орто,
          кара бакыраң көздүү, жүзү абдан жагымдуу, кең далылуу, колдору жана
          моюну жоон болгон.
        </ListItem>
        <ListItem>
          5-Алинин өзгөчөлүктөрү. Эгер Абу Бакр жумшак мүнөз, бирок ошол эле
          учурда чечкиндүү болсо, Умар талапты кое билге жана адилеттүүлүгү
          менен, Усман –дипломат, өз ара кызматташууга аракетчил болсо, Али
          биринчи кезекте динди терең түшүнгөндүгү, аскет жашоо образы жана
          тайманбастыгы менен өзгөчөлөнүп турчу.
        </ListItem>
        <ListItem>
          6 -Алинин атасы Абу Талиб Пайгамбарыбызды (Алланын ага
          салам-салаваттары болсун) өз баласындай көргөн. Абу Талибдин колунда
          жок болгону менен өз уруусунда кадыр-баркка ээ эле. Ал пайгамбарбыз
          Мухамедди абдан жакшы көрчү жана бир жакка барарда сөзсүз аны жанына
          алып алчу. Пайгамбарыбыздын атасы кайтыш болгон соң дал ушул адам ага
          кам көргөн. Алла Элчиси Аллахка сыйынууга ачык үгүт жүргүзө баштаганда
          биринчилерден болуп Абу Талиб коргогон. Абу Талиб Бану хашим уруусунун
          башчыларынын бири болгондуктан, ал бул абалынан пайдаланып,
          Пайгамбарыбызды болушунча жактап, коргогон. Хашимиттер айласыздан Абу
          Талибге кошулуп, Алла Элчисинин тарабында турушкан. Абу Талиб
          Пайгамбарыбызды коргоодо жанын аябарын жар салган.
        </ListItem>
        <ListItem>
          7- Али (Аллах андан ыраазы болсун) исламды бала кезинде кабыл алган.
          Көптөрү Али исламды 10 жашында кабыл алганын айтышат. Бул анын өз
          каалоосу жана кызыгуусу менен болгон.
        </ListItem>
        <ListItem>
          8- Алинин үй-бүлөсү. Али Пайгамбарыбыздын кызы сүйүктүү кызы Фатиманы
          жубайлыкка алган.
        </ListItem>
        <Paragraph>
          Али Фатиманын колун сурап келгенде калканынан башка эч нерсеси жок
          эле. Сүйүктүү кызынын колун сурап келген Алинин сүрдөп жатканын сезген
          Пайгамбарыбыз Алинин сүрдөгөнүн токтотуш үчүн: “Сен Фатиманын колун
          суроого келдиң окшойт?”,-деп сөз баштайт. Али “ооба” деп жооп берет.
          Пайгамбарыбыз “Махрга эмне даярдадың?” деп суроо салат. Алинин
          колундагы калканынан башка эч нерсеси жок эле. Пайгамбарыбыз Алиге:
          “Сен калканыңды сатып, андан түшкөн акчаны махрга колдонбойсуңбу” деп
          сунуштайт. Али так ошондой кылат
        </Paragraph>
        <br />
        <Paragraphstyle>
          {' '}
          Фатима менен Алинин үй-бүлөөсү чоң сүйүү менен сый-урматта курулуп, 4
          балалуу болушат. 2 уул: аль-Хасан, аль-Хусейн жана 2 кыз: Зайнаб, Умм
          Кульсум.
        </Paragraphstyle>
      </List>
      <Imagee src={AliIbnAbutTalibKaabaImg} alt="kaaba" />
    </Container>
  );
};

export default AliIbnAbuTalib;

const Paragraph = styled.p`
  font-size: 16px;
  line-height: 1.6;
  color: #333;
`;
const Paragraphstyle = styled.p`
  font-size: 16px;
  line-height: 1.6;
  color: #333;
  text-align: center;
`;

const Container = styled.div`
  text-align: center;
`;

const Title = styled.h1`
  font-size: 24px;
  color: #333;
  margin-bottom: 20px;
`;

const Image = styled.img`
  max-width: 500px;
  height: auto;
  border-radius: 8px;
  margin-bottom: 20px;
`;
const Imagee = styled.img`
  max-width: 500px;
  height: auto;
  border-radius: 1rem;
  padding: 1rem;
`;

const List = styled.ul`
  list-style-type: none;
  padding: 0;
  margin: 0;
  text-align: left;
`;

const ListItem = styled.li`
  font-size: 14px;
  line-height: 1.4;
  color: #555;
  margin-bottom: 10px;
`;
