import SaidIbnZaidImg from '../assets/images/siadibnzaidra.jpeg';
import styled from 'styled-components';

const SaidIbnZaid = () => {
  return (
    <Container>
      <Title>Ислам тарыхы</Title>
      <h3>19 жашында мусулман болгон Саид ибн Зейд(р.а) жөнүндө </h3>
      <Image src={SaidIbnZaidImg} alt="ImgAbuUbaidah" />

      <Paragraph>
        Саид ибн Зейд (Аллах андан ыраазы болсун) көзү тирүүсүндө эле бейиш
        менен кубандырылган сахаба, исламдын дүйнө жүзүнө таралышында салымы чоң
        жоокер, адеп-ахлагы бийик, жүрөгү таза, калк арасында урмат-сыйга ээ
        болгон адам болгон.
      </Paragraph>
      <br />
      <Paragraph>
        Саид ибн Зейддин атасы өзгөчө адам эле. Атасынын аты - Зейд ибн Амр ибн
        Нуфайл. Саид ибн Зейддин атасы исламга келгенге чейин эле бутпарастыкка
        каршы болуп, көп кудайга ишенгендер менен тартышкан. Чындыкты табуу үчүн
        жер кыдырган. Бирок Пайгамбарыбызга пайгамбарлык миссия түшө электе
        кайтыш болот. Саид ибн Зейд пайгамбарыбыз Мухаммедден (Аллахтын ага
        салам-салаваттары болсун) атасынын тагдыры эмне болору тууралуу
        сураганда, ал минтип жооп берген: « Кыямат күнү адамдар өз
        пайгамбарларынын артында турушат. Ал эми сенин атаң өзү жалгыз бүтүндөй
        үммөт сымал жалгыз турат»,-деп айткан.
      </Paragraph>
      <br />
      <Paragraph>
        Саид ибн Зейд жубайы экөө Умар ибн аль-Хаттабдын исламды кабыл алышына
        себепчи болушкан. Бир жолу Умар (Аллах андан ыраазы болсун)
        пайгамбарыбызга жинденип, аны өлтүрүү үчүн бара жатканда жолдон аны
        бирөө токтотуп, ага алгач өз үй-бүлөсүн иретке келтирип алуусун айтат.
        Жинденген Умар эжесинин үйүн көздөй жөнөйт. Бул убакта эжеси күйөөсү
        Саид менен Куран окуп жатышкан. Умар кирип келип, Саидди жерге жаткырып
        сабай баштайт. Күйөөсүнө болушкан Фатима исламды кабыл алышкандыктарын
        айтып, эмне кылсаң ошо кыл дейт. Умар жини менен эжесин чаап жиберет.
        Эжесинин бетиндеги канды көргөндө Умар кылган ишине өкүнүп, бир аз
        тынчып отуруп калат. Андан соң Умар ибн аль-Хаттаб: “Эмнени окуп
        жаттыңар эле? Мага көрсөткүлөчү” дейт. Балким Умар да исламды кабыл алып
        калат деген ниетте алар окуп жаткан “Та-ха” сүрөсү жазылган кагазды
        беришет. Умар аятты аяганы чейин окуп бүтүп “Бул жакта жазылган сөздөр
        кандай гана керемет”, - деп исламды кабыл алгысы келгенин айткан.
      </Paragraph>
      <br />
      <Paragraph>
        Халид башчылык кылган Ярмуктагы согуш мусулмандардын тарыхындагы эң
        катуу салгылаш катары белгилүү. Бул салгылашта Халид Саидди армиянын
        борбордук бөлүгүнө башчылыкка койгон. Ошол күнү Саид абдан таң калычтуу
        мындай сөздү айткан. Ал өзүнө Абу Убайда ибн аль- Джаррахты чакырып: “О,
        Абу Убайда мен бүгүн шейит болууга ниеттенип турам. Эгер мен
        Пайгамбарыбызды жолуктуруп калсам, ага сенин атыңдан эмне деп айтып
        коеюн?”-дейт. Анда Абу Убайда: “Эгер сен пайгамбарыбызды жолуктуруп
        калсаң, ага бардык мусулмандардын атынан салам айт. Пайгамбарыбызга
        Аллах Тааланын бизге берген убадаларынын чындыгына биздин көзүбүз жетти
        дегин”, -дейт. Бул күнү Саид ибн Зейддин жүрөгүнөн коркунучтардын баары
        алынып, ал коркунуч эч качан кайра пайда болбогонун өзү айткан. Саид
        Ярмуктагы согушта шейит кетүүнү каалаганы менен Аллах Таала анын
        жашоосун сактап калган.
      </Paragraph>
      <br />
      <Paragraph>
        Саид ибн Зейд салгылашта шейит болуп жан берүүнү каалаганы менен андай
        болгон жок. Ал таң эрте чың ден соолукта багымдат намазына мечитке
        барып, кайра үйүнө келип, уктап жатып жан берген. Саад ибн Абу Ваккас
        жана Абдуллах ибн Умар анын денесин жууп, кепинге ороп, жаназа намазын
        окушкан. Бул экөө абдан таң калычтуу мындай кепти айтышкан. Алар Саиддин
        денесине жыпар жытты чачарда, анын денеси өзү эле өтө жагымдуу, таттуу
        жытты бөлүп чыгарганын айтышкан. Мындай жол менен Аллах Таала Саид ибн
        Зейддин ислам жолундагы кылган кызматы кабыл болгонун айтып жаткандай.
      </Paragraph>
    </Container>
  );
};

export default SaidIbnZaid;

const Paragraph = styled.p`
  font-size: 16px;
  line-height: 1.6;
  color: #333;
`;

const Container = styled.div`
  text-align: center;
`;

const Title = styled.h1`
  font-size: 24px;
  color: #333;
  margin-bottom: 20px;
`;

const Image = styled.img`
  max-width: 500px;
  height: auto;
  border-radius: 8px;
  margin-bottom: 20px;
`;
