import React from 'react';
import styled from 'styled-components';
import TalhaRaimg from '../assets/images/talhara.jpeg';

const TalhaIbnUbaudyllah = () => {
  return (
    <div>
      <Container>
        <Title>Ислам тарыхы</Title>
        <h3>Тирүүсүндө бейиш убадаланган сахаба Тальха ибн Убайдуллах</h3>
        <Image src={TalhaRaimg} alt="ImgAbuUbaidah" />

        <Paragraph>
          Пайгамбарыбыз Мухаммед (Алланын ага салам-салаваттары болсун) Тальха
          ибн Убайдуллах менен бейиште кошуна болорун айткан. Эгер пайгамбарыбыз
          Мухаммеддин (Аллахтын ага салам-салаваттары болсун) өмүр баянына көз
          жүгүртсөк, бири-бири менен жанаша айтылган 2 атты көрөбүз. Алар -
          Тальха ибн Убайдуллах, Зубайр ибн Аль-Аввам (Аллах алардан ыраазы
          болсун). Бул эки сахабанын тең ислам тарыхындагы орду чоң.
          Пайгамбарыбыз Тальха менен Зубайр экөө тең бейиште аны менен кошуна
          болорун айткан.
        </Paragraph>
        <Paragraph>
          Тальха ибн Убайдуллах Абу Бакр ас-Сыддыктын тууганы болгон. Экөө бир
          уруудан эле.
        </Paragraph>
        <Paragraph>
          Тальха ибн Убайдуллах бай соодагерлердин бири болгон. Ал бир нече ирет
          Меккеден тышкары чыгып ,соода иштерин жүргүзгөн. Мына ошондой
          сапарлардын бири анын жашоосун толугу менен өзгөрткөн.
        </Paragraph>
        <Paragraph>
          Тальха (Аллах андан ыраазы болусун) ак жуумал, орто бойлуу жана кең
          далылуу болгону айтылат. Ал артка караганда бүткүл денеси менен
          бурулчу экен. Айша (р.а.))
        </Paragraph>
        <List>
          <ListItem>
            Бул сахаба исламды алгачкылардан болуп кабыл алган меккеликтердин
            ичинде эле. Ал Сирияда өз иштери менен жүргөндө пайгамбарыбыз
            жакында эле Шамдан кеткенин угат. Бир кечил ага, чындыгында, анын
            Пайгамбар экенин айтат. Тальха Меккеге кайтканда ал жок кезде бул
            жерде эмне болгонун сураштыра баштайт. Алар Мухаммед (Алланын ага
            салам-салаваттары болсун) өзүн пайгамбар деп жарыялаганын айтышат.
            Муну уккан Тальха тууганы Абу Бакрдыкына барат. “Сен Мухаммеддин
            (Аллахтын ага салам-салаваттары болсун) эмне деп айтканын уктуңбу?”,
            - деп сурайт. “Ооба, ал айтып жаткан нерсе чындык, жана ал бизди
            чындыкка гана чакырып жатат. Сен дагы аны ээрчишиң керек”, -дейт Абу
            Бакр. Тальха ошентип исламды кабыл алат.
          </ListItem>
        </List>
        <Paragraph>
          Тальха ибн Убайдуллах исламды кабыл алганда бир топ кыйынчылыктарды
          көргөн. Абу Бакр менен Тальха коомдо урмат-сыйга ээ болгон адамдардан
          эле. Тальха анда18 жашта гана болгон. Исламды кабыл алган соң алар
          курайшиттер тарабынан чоң сыноого кабылышкан. Курайшиттер коомдо
          салмагы бар адамдарды элдин көзүнчө жазалабай, туугандарына өткөрүп
          беришкен. Хадижанын байкес иНауфаль ибн Хувайлид Тальха менен Абу
          Бакрды бириктирип байлап алып кыйнаган.
        </Paragraph>
        <Paragraph>
          Тальха 3 лакап ат койгон. Саид ибн Зейд жана дагы бир бейиш менен
          кубандырылган сахаба: “Мен Тальха менен нечен ирет саякатка чыктым.
          Бирок Тальхадан өтөр берешен адамды көргөн жокмун”,-деген. Тальха
          өзүнүн тынымсыз кайрымдуулугу, жакшы иштерде дайыма биринси
          болгонунан, Пайгамбарыбыз ага мындай 3 лакап ат койгон: “Мыкты
          сапаттардын ээси”, “Кең пейилдиктин ээси”, “Берешендиктин ээси”.
        </Paragraph>
        <Paragraph>
          Пайгамбарыбыз Тальханы “тирүү шахид” деп атаган. Ухуддагы салгылаш
          Тальханын мыкты сапаттарын ачат. Бул салгылашта пайгамбарыбыз көп
          жаракат алат. Салгылашта пайгамбарыбыздын бир нече алдыңкы тиштери
          түшүп калган. Тальха пайгамбарыбыздын чабуулда калганын уккканда дароо
          жетип барып, аны ушунчалык берилгендик менен коргой баштайт.
          Пайгамбарыбыз ал күн тууралуу минтип айткан: “Ухуддагы салгылашта
          силер мени көрүшүңөр керек болчу. Менин оң тарабымда Жабраил, сол
          тарабымда Тальха турган эле”. Пайгамбарыбыз тарапка душмандардан ок
          чыгарылат. Ал окту Тальха колун созуп барып тосуп калат. Ок Тальханын
          колун тешип өтөт. Ошондон кийин анын колу кыймылдабай калган. Андан
          кийин ал берки колу менен пайгамбарыбызды ийнине көтөрүп, коопсуз
          жайга алып барат. Пайгамбарыбыздын кызы Фатима мындай деп айткан:
          “Ошол күнү атамдын денесинде 24 жаракат болгон. Тальха пайгамбарыбызды
          коопсуз жайга алып баргандан кийин дароо эс-учун жоготкон. Себеби
          андан кан көп кетип калган эле”. Ухуддагы салгылашта пайгамбарыбыз
          Тальханын кыймыл-аракетин көрүп, ага ушунчалык суктанган. Согуш
          учурунда пайгамбарыбыз Мухаммед (Алланын ага салам-салаваттары болсун)
          минтип айткан: “ Ким 2 буту менен басып жүргөн тирүү шахидди көргүсү
          келсе, анда ал Тальха ибн Убайдуллахты карасын”.
        </Paragraph>
        <Paragraph>
          Ухуд күнү- Тальханын күнү болду” Абу Бакр ас-Сыддык Ухуд күнүн
          эстегенде минтип айтар эле: “Ухуд күнү бул - Тальханын күнү эле”.
          Анткени бул салгылашта Тальха болуп көрбөгөндөй берилүү, эр жүрөктүк,
          тайманбастык менен пайгамбарыбызды коргогон.
        </Paragraph>
        <Paragraph>
          Пайгамбарыбыз элдерди кайсы бир ишке чакырганда Тальха дайым
          биринчилерден болор эле. Ал үчүн, мейли, мал-мүлкүн курмандыкка чалыш
          керекпи же өмүрүнбү, Тальха ибн Убайдуллах (Аллах андан ыраазы болсун)
          артка тарчу эмес.
        </Paragraph>
      </Container>
    </div>
  );
};

export default TalhaIbnUbaudyllah;

const Paragraph = styled.p`
  font-size: 16px;
  line-height: 1.6;
  color: #333;
`;

const Container = styled.div`
  text-align: center;
`;

const Title = styled.h1`
  font-size: 24px;
  color: #333;
  margin-bottom: 20px;
`;

const Image = styled.img`
  max-width: 500px;
  height: auto;
  border-radius: 8px;
  margin-bottom: 20px;
  border-radius: 1rem;
`;

const List = styled.ul`
  list-style-type: none;
  padding: 0;
  margin: 0;
  text-align: left;
`;

const ListItem = styled.li`
  font-size: 14px;
  line-height: 1.4;
  color: #555;
  margin-bottom: 10px;
`;
