import React from 'react';
import styled from 'styled-components';
import UsmanIbnImg from '../assets/images/1200px-Rashidun_Caliph_Uthman_ibn_Affan_-_عثمان_بن_عفان_ثالث_الخلفاء_الراشدين.svg.png';
const UsmanIbnAffan = () => {
  return (
    <Container>
      <Title>Усман Ибн Аффан (радыяллаху анхy)</Title>
      <Image src={UsmanIbnImg} alt="khalif" />
      <Paragraph>
        Абульас бин Умаййа бин Абди Шамс бин Абди Манафтын урпагынан. Ашараи
        мубашшарадан. Осман – үчүнчү халифа. Расулуллахтын эки кызын алгандыктан
        "Зиннурейн" деп аталган. Төртүнчү болуп Исламиятты кабыл алган. Жубайы
        Рукыя менен бирге эки жолу Хабашистанга (Эфиопия), андан соң Мединага
        хижрат кылган. Өтө бай соодагер болгон. Бардык мал-мүлкүн Ислам жолуна
        жумшаган. Хилми жана хаясы менен (жумшак мүнөзү жана уяттуулугу) аты
        чыккан. Хижраттын 24-жылы 1-Мухаррамда халифа болуп шайланган. Кипр
        аралын мусулмандарга алып берген. 35-жылы Зилхижжа айында Курани карим
        окуп отурган учурда шейит кылынган. Хадиси шарифтерде ага мактоолор
        айтылган. Орто бойлуу, сакалы калын, саргыч өңдүү, өтө сулуу жүздүү эле.
        Бадр согушунан башка бардык согуштарга катышкан. Намаздын бир рекетинде
        Курани каримди баштан аяк окуп чыккан төрт адамдын бири болуп саналат.
        Көп окугандыктан эки мусхафты эскирткен. Хазрети Абу Бакрдын жыйнаган
        Курани каримден дагы алты нуска жаздырып, алты жерге жиберген.
      </Paragraph>
      <List>
        <ListItem>
          Ислам дини жайыла баштагандан кийин ар тараптан мусулман болгондор
          Медина-и Мунавварага келе башташат. Масжид-и шариф тар болгондуктан
          келгендерге орун тар боло баштаган. Талаага чатыр тигип отурушат.
          Пайгамбарыбыз Мухаммед алейхиссалам: "Кимде-ким биздин ушул мечитти
          бир зра кеңейтсе, Бейишке барат", - дегенде, Осман (радыяллаху анх)
          "Йа, Расулаллах! Менин мал-мүлкүм Сиздин жолуңузга курман болсун. Мен
          кеңейтем", - деди. Ошентип, мечитти кырк зра кеңейтип берди.
        </ListItem>
        <ListItem>
          Ошол окуядан кийин Аллаху таала: "Аллаху тааланын мечиттерин бир гана
          Аллахка жана акырет күнүнө ишенген, намазын толук окуган, зекетин
          берген жана Аллаху тааладан корккон адамдар курушат. Ошол сыпаттагы
          адамдарга Бейишке алып баруучу амалдарды жасоо керек", - деген
          маанидеги Тообо сүрөсүнүн 18-аятын жиберди.
        </ListItem>
      </List>
    </Container>
  );
};

export default UsmanIbnAffan;

const Paragraph = styled.p`
  font-size: 16px;
  line-height: 1.6;
  color: #333;
`;

const Container = styled.div`
  text-align: center;
`;

const Title = styled.h1`
  font-size: 24px;
  color: #333;
  margin-bottom: 20px;
`;

const Image = styled.img`
  max-width: 500px;
  height: auto;
  border-radius: 8px;
  margin-bottom: 20px;
`;

const List = styled.ul`
  list-style-type: none;
  padding: 0;
  margin: 0;
  text-align: left;
`;

const ListItem = styled.li`
  font-size: 14px;
  line-height: 1.4;
  color: #555;
  margin-bottom: 10px;
`;
