import ZubairIbnAvvamImg from '../assets/images/zubairraa.jpeg';
import styled from 'styled-components';

const ZubairIbnAvvam = () => {
  return (
    <Container>
      <Title>Ислам тарыхы</Title>
      <h3>Аз-Зубайр ибн Аввам</h3>
      <Image src={ZubairIbnAvvamImg} alt="ImgAbuUbaidah" />

      <Paragraph>
        Пайгамбарыбыз Мухаммед (Аллахтын ага салам-салаваттары болсун) Аз
        –Зубайр ибн Аввам аны менен бейиште кошуна болорун айткан. Эгер
        пайгамбарыбыз Мухаммеддин (Аллахтын ага салам-салаваттары болсун) өмүр
        баянына көз жүгүртсөк, бири-бири менен жанаша айтылган 2 атты көрөбүз.
        Алар - Тальха ибн Убайдуллах менен Зубайр ибн Аль-Аввам (Аллах алардан
        ыраазы болсун). Бул эки сахабанын тең ислам тарыхындагы орду чоң.
        Пайгамбарыбыз Тальха менен Зубайр экөө тең бейиште аны менен кошуна
        болорун айткан.
      </Paragraph>
      <br />
      <Paragraph>
        Аз-Зубайр ибн Аввам (Аллах андан ыраазы болсун) Исламды өтө жаш кезинде
        кабыл алган. Анда ал болгону 12 жашта эле.
      </Paragraph>
      <br />
      <Paragraph>
        Аз-Зубайр Пайгамбарыбыз Мухаммеддин (Аллахтын ага салам-салаваттары
        болсун) тууганы болгон. Анткени Аз-Зубайрдын апасы Сафия
        Пайгамбарыбыздын эжеси эле.
      </Paragraph>
      <br />
      <Paragraph>
        Аз-Зубайр кичинекей кезинде исламды кабыл алганы үчүн авасынан кордук
        көргөн. Бул сахабанын атасы эрте кайтыш болуп калгандыктан аны тарбиялоо
        милдети авасы Науфаль ибн Хувайлидге жүктөлгөн. Науфаль Аз-Зубайрды
        исламды кабыл алганы үчүн жана анын жаштыгынан пайдаланып аны түрдүү
        жолдор менен кыйнаган. Ал аны килемге ороп, түтүн менен тумчуктурган.
        Меккенин жашоочулары күн сайын Аз-Зубайрдын кыйналгандан кыйкырганын
        угуп турушкан.
      </Paragraph>
      <br />
      <Paragraph>
        Аз-Зубайр кичинесинде эле Пайгамбарыбызды айланчыктаган балдардын бири
        болгон. Аз Зубайр, Тальха, Али үчөө кичинекей кездеринде, ислам жаңыдан
        жайылып баштаган убакта дайыма пайгамбарыбыз Мухаммедди (Аллахтын ага
        салам-салаваттары болсун) жандап, айланчыктап турушкан.
      </Paragraph>
      <Paragraph>
        3000 периште Аз-Зубайрды туурап согушканда... Бадрдагы согушта Аз Зубайр
        өзгөчө сый-урматка ээ болгон. Бул салгылашта пайгамбарыбыздын болгону 2
        атчан жоокери бар эле. Ал эми курайшиттер 300 атчан жоокер менен
        келишкен. Ошол атчандардын бири - Аз -Зубайр ибн Аввам эле. Ал бир
        убакта 2 колуна кылыч кармап, оң буту менен атты башкарып согуша алган
        таланттын ээси болчу. Бадрдагы согушта Аз – Зубайр башына сары селде
        кийген. Ал бул кагылышта ушунчалык эрдик менен салгылашкандыктан, Аллах
        Таала аны чоң сый -урматка бөлөгөн. Ыйык Куранда Аллах Таала Бадрдагы
        согушта мусулмандарга 3000 периштени жардамга жибергени айтылат. Бул
        периштелердин баары Аз -Зубайрды туурап согушушкан. Пайгамбарыбыз
        Мухаммед (Аллахтын ага салам-салаваттары болсун) периштелердин баарында
        сары селде болгонун, ушундай жол менен алар Аз- Зубайрдан үлгү алышканын
        айткан.
      </Paragraph>
      <Paragraph>
        Ухуддагы согушта болсо көп кудайга ишенгендердин тарабында Тальха ибн
        Абитальха аль Абдари турган. Анын согушка ылайыкталган эң мыкты минген
        аты бар эле. Мындан тышкары, ал эр жүрөк, эч кимден коркпогон, сүрдүү
        жоокер катары таанымал болчу. Согуштан мурда Тальха ибн Абитальха
        мусулмандардан салгылашка бирөөсүн чакырат. Аз - Зубайр анын чакырыгын
        дароо кабыл алып, күрөшкө чыгат. Аз-Зубайрдын апасы Сафия
        Пайгамбарыбызга чуркап келет да минтип айтат: “Ал менин баламды
        өлтүрөт”. Пайгамбарыбыз Сафияга мындай деп жооп берет: “Жок, жок, Аз
        Зубайр аны өлтүрөт, эгер Аллах кааласа”. Мына ошондо Аз - Зубайр Тальха
        ибн Абитальхага келип, кылычын жерге коюп, анын атына чыгып, Тальха ибн
        Абитальханы өзүнүн кылычы менен өлтүрөт дагы, аны жерге түшүрүп, бошогон
        мыкты атты мусулмандар тарапка алып келген.
      </Paragraph>
      <Paragraph>
        Аз-Зубайр намаз окуп жаткан убакта өлтүрүлгөн. Тилекке каршы, Аз-Зубайр
        Усмандын өлүмүнөн кийинки фитнага айласыздан аралашып калган. Аз-Зубайр
        Усмандын каны үчүн өч алууну талап кылып, Айша менен Тальханын тарабында
        болот. Ислам тарыхында белгилүү болгондой, Усмандын өлүмүнө байланыштуу
        Айша менен Али акырында бир пикирге келишет. Ошондо Али Аз- Зубайрга
        пайгамбарыбыздын убагында болгон бир окуяны эскертет. Бир жолу
        пайгамбарыбыз Али менен Аз- Зубайрды чогуу көрүп калып, Аз- Зубайрдан
        минтип сурайт: “Сен Алини жакшы көрөсүңбү?”. Али: “Албетте жакшы
        көрөм”,- дейт. Анда пайгамбарыбыз: “Силер бири бириңерге каршы
        согушасыңар, бул кырдаалда сен Алиге карата адилетсиз болосуң”,- деп
        айткан.Бул окуяны уккандан кийин Аз-Зубайр Алиге баш ийүү антын берип,
        андан соң фитна аралашкан согуш талаасын таштап кетет. Бирок бул окуя
        Аз- Зубайрдын адилетсиздигин билдирбейт. Эгерде мындай болгон болсо,
        пайгамбарыбыз аны менен бейиште кошуна болорун айтмак эмес. Аллах Элчиси
        болгону фитна болгон заманда алардын буга аралашпаганы жакшы экендигин
        эскерткен. Аз - Зубайр согуш талаасын таштап кеткен соң өзүнчө жолго
        чыгат. Аны артынан харижиттердин бири Амр ибн Жармуз кууп жетип, ага
        шерик болууну каалаганын айтат. Аз-Зубайр буга макул болот. Түшкү намаз
        убагы келип, Аз-Зубайр даарат алып, намаз окуп жаткан кезде Амр ибн
        Жармуз аны сайып өлтүрөт. Мындай жол менен ал Алиге жаккыдай иш кылам
        деп ойлогон. Аз-Зубайрдын канга боелгон кылычын Алинин лагерине алып
        келген убакта Али Аз-Зубайрдын тагдыры эмне болгонун билип, ыйлай
        баштайт. Андан соң ал “эгер силер Сафиянын баласын өлтүргөн адамды
        көрсөңөр анда аны тозок менен кабарландыргыла” деп айтат. Бул убакта Амр
        ибн Жармуз качып кетүүгө үлгүрүп, бир нече убакыттан кийин ал өзүн өзү
        өлтүрүп тынат. Кошумчалай кетчү нерсе Аз-Зубайрдын 2 баласы да атасы
        сымал намаз убагында өлтүрүлгөн. Алар Аллах жолунда бел чечпей кызмат
        кылышкандыктан Аллах Таала алардын ибадат кылып жаткан кездеринде бул
        дүйнө менен кош айтышуу мүмкүнчүлүгүн берген.
      </Paragraph>
    </Container>
  );
};

export default ZubairIbnAvvam;

const Paragraph = styled.p`
  font-size: 16px;
  line-height: 1.6;
  color: #333;
`;

const Container = styled.div`
  text-align: center;
`;

const Title = styled.h1`
  font-size: 24px;
  color: #333;
  margin-bottom: 20px;
`;

const Image = styled.img`
  max-width: 500px;
  height: auto;
  border-radius: 8px;
  margin-bottom: 20px;
`;
