import { Container, Typography, styled } from '@mui/material';
import React from 'react';

const Khadis = () => {
  return (
    <StyleContainer>
      <StyleBannerText>
        <h2>ЖАШООДО КОЛДОНУУГА ЭҢ КЕРЕКТҮҮ КЫСКА-НУСКА ХАДИСТЕР ТОПТОМУ.</h2>
      </StyleBannerText>
      <Typography>
        <Typography>
          <br /> قال رسول الله صلى الله عليه وسلم : « إن الله لا ينظر إلى صوركم
          و أموالكم ، و لكن ينظر إلى قلوبكم و أعمالكم ». 1 <br /> <br />
        </Typography>
        Чындыгында Аллах Таала силердин келбетиңерге жана байлыгыңарга карабайт.
        Бирок силердин жүрөгүңөргө жана амалыңарга карайт.
      </Typography>
      <br />
      <Typography>
        <Typography>
          قال رسول الله صلى الله عليه وسلم : « لولا أن أشق على أمتي، لأمرتهم
          بالسواك عند كل صلاة ».{' '}
        </Typography>{' '}
        <br />
        2-Үммөттөрүмө оор болбогондо, ар бир намаздын алдында мисвак колдонууну
        сөзсүз буюрмакмын.
      </Typography>
      <br />
      <Typography>
        <Typography>
          قال رسول الله صلى الله عليه وسلم : « من بطأ به عمله لم يسرع به نسبه ».
        </Typography>
        <br />
        3-Кимди өз иши (ибадаттан тосуп) акырындаштырган болсо, анын ата -
        тектүүлүгү алдыга жылууга жардам бере албайт.
      </Typography>
      <Typography>
        <Typography>
          <br /> قال رسول الله صلى الله عليه وسلم : « من دل على خير فله مثل أجر
          فاعله
        </Typography>
        <br />
        4-Ким жакшылыкты ( жасоону башкаларга) үйрөтсө, амал кылганга берилген
        сооп ага да берилет.
      </Typography>
      <br />
      <Typography>
        قال رسول الله صلى الله عليه وسلم : « من رضي بالله ربا، و بالاسلام دينا،
        و بمحمد نبيا، وجبت له الجنة ».
        <Typography>
          <br />
          5-Ким Жаратуучусун Аллах деп, динин Ислам деп, Пайгамбарын Мухаммад
          (c.a.в) деп ыраазы болсо, ага Бейиш важиб болот.
        </Typography>
      </Typography>
      <br />
      <Typography>
        قال رسول الله صلى الله عليه وسلم: « من صلى علي صلاة صلى الله عليه بها
        عشرا ».
        <Typography>
          <br />
          6-Ким мага бир жолу салават айтса, Аллах Таала ага он жолу салават
          айтат.
        </Typography>
      </Typography>
      <br />
      <Typography>
        قال رسول الله صلى الله عليه وسلم : « من يرد الله به خيرا يفقهه في الدين
        ». 7
        <Typography>
          <br />
          Аллах кимге жакшылыкты кааласа, ага диний илиминен түшүнүк берет.{' '}
        </Typography>
      </Typography>
      <br />
      <Typography>
        (قال رسول الله صلى الله عليه وسلم : « من كان له فضل زاد، فليعد به على من
        لا زاد له ».
        <Typography>
          <br />
          8-Кимде ашыкча азыгы болсо, аны азыгы жокторго берсин!
        </Typography>
        <br />
      </Typography>
      <Typography>
        قال رسول الله صلى الله عليه وسلم : « كلكم راع و كلكم مسؤول عن رعيته »
        <Typography>
          <br />
          9-Силердин ар бириңер башчысыңар жана ар бириңер кол астыңардагылар
          тууралуу (Кыямат күнү) суралуучусуңар.
        </Typography>
      </Typography>
      <br />
      <Typography>
        قال رسول الله صلى الله عليه وسلم : « من سلك طريقا يلتمس فيه علما ، سهل
        الله له به طريقا الى الجنة
        <Typography>
          <br />
          10-Ким илим алуу үчүн жолго (же сапарга) чыккан болсо, Аллах ага
          Бейишке алып барчу жолун жеңил кылып койот.
        </Typography>
      </Typography>
      <br />
      <br />
    </StyleContainer>
  );
};

export default Khadis;

const StyleBannerText = styled('div')(() => ({
  fontSize: '2rem',
  padding: '2rem',
}));

const StyleContainer = styled(Container)(() => ({
  textAlign: 'center',
  padding: '1rem',
}));
