import { Container, Typography, styled } from '@mui/material';
import React from 'react';

const Khadis = () => {
  return (
    <StyleContainer>
      <StyleBannerText>
        <h2>ЖАШООДО КОЛДОНУУГА ЭҢ КЕРЕКТҮҮ КЫСКА-НУСКА ХАДИСТЕР ТОПТОМУ.</h2>
      </StyleBannerText>
      <Typography>
        1-Чындыгында Аллах Таала силердин келбетиңерге жана байлыгыңарга
        карабайт. Бирок силердин жүрөгүңөргө жана амалыңарга карайт. <br />
        <br /> (1) قال رسول الله صلى الله عليه وسلم : « إن الله لا ينظر إلى
        صوركم و أموالكم ، و لكن ينظر إلى قلوبكم و أعمالكم ». [ صحيح مسلم ]
      </Typography>
      <br />
      <br />
      <Typography>
        2-Үммөттөрүмө оор болбогондо, ар бир намаздын алдында мисвак колдонууну
        сөзсүз буюрмакмын. <br />
        <br /> (2) قال رسول الله صلى الله عليه وسلم : « لولا أن أشق على أمتي،
        لأمرتهم بالسواك عند كل صلاة ».
      </Typography>
      <br />
      <br />
      <Typography>
        3-Кимди өз иши (ибадаттан тосуп) акырындаштырган болсо, анын ата -
        тектүүлүгү алдыга жылууга жардам бере албайт. <br />
        <br /> ( 3) قال رسول الله صلى الله عليه وسلم : « من بطأ به عمله لم يسرع
        به نسبه ». [صحيح مسلم ]
      </Typography>
      <br />
      <br />
      <Typography>
        4-Ким жакшылыкты ( жасоону башкаларга) үйрөтсө, амал кылганга берилген
        сооп ага да берилет. <br />
        <br /> ( 4) قال رسول الله صلى الله عليه وسلم : « من دل على خير فله مثل
        أجر فاعله [ صحيح مسلم]
      </Typography>
      <br />
      <br />
      <Typography>
        5-Ким Жаратуучусун Аллах деп, динин Ислам деп, Пайгамбарын Мухаммад (Ага
        Аллахтын тынчтыгы жана саламы болсун) деп ыраазы болсо, ага Бейиш важиб
        болот. <br />
        <br /> ( 5) قال رسول الله صلى الله عليه وسلم : « من رضي بالله ربا، و
        بالاسلام دينا، و بمحمد نبيا، وجبت له الجنة ». [ صحيح مسلم ]
      </Typography>
      <br />
      <br />
      <Typography>
        6-Ким мага бир жолу салават айтса, Аллах Таала ага он жолу салават
        айтат. <br />
        <br /> ( 6) قال رسول الله صلى الله عليه وسلم: « من صلى علي صلاة صلى الله
        عليه بها عشرا ». [ صحيح مسلم ]
      </Typography>
      <br />
      <br />
      <Typography>
        7-Аллах кимге жакшылыкты кааласа, ага диний илиминен түшүнүк берет.{' '}
        <br />
        <br /> (7) قال رسول الله صلى الله عليه وسلم : « من يرد الله به خيرا
        يفقهه في الدين ». [ صحيح مسلم ]
      </Typography>
      <br />
      <br />
      <Typography>
        8-Кимде ашыкча азыгы болсо, аны азыгы жокторго берсин! <br />
        <br /> (قال رسول الله صلى الله عليه وسلم : « من كان له فضل زاد، فليعد به
        على من لا زاد له ». [ صحيح مسلم ]
      </Typography>
      <br />
      <br />
      <Typography>
        9-Силердин ар бириңер башчысыңар жана ар бириңер кол астыңардагылар
        тууралуу (Кыямат күнү) суралуучусуңар. <br />
        <br /> ( 9) قال رسول الله صلى الله عليه وسلم : « كلكم راع و كلكم مسؤول
        عن رعيته » [ صحيح البخاري ]
      </Typography>
      <br />
      <br />
      <Typography>
        10-Ким илим алуу үчүн жолго (же сапарга) чыккан болсо, Аллах ага Бейишке
        алып барчу жолун жеңил кылып койот. <br />
        <br /> ( 10) قال رسول الله صلى الله عليه وسلم : « من سلك طريقا يلتمس فيه
        علما ، سهل الله له به طريقا الى الجنة [ صحيح مسلم ]
      </Typography>
      <br />
      <br />
    </StyleContainer>
  );
};

export default Khadis;

const StyleBannerText = styled('div')(() => ({
  fontSize: '2rem',
  padding: '2rem',
}));

const StyleContainer = styled(Container)(() => ({
  textAlign: 'center',
  padding: '1rem',
}));
