import { Container, Typography, styled } from '@mui/material';
import React from 'react';

const Zikr = () => {
  return (
    <StyleContainer>
      <StyleBannerText>
        <h2>Ар күн окула турчу дубалар</h2>
      </StyleBannerText>
      <Typography>
        «Намаздан кийин дуба кылууда «Аллахумма ажирни минаннар ва адхылнил
        Жанната» деп окубаса периштелер: «Убал буга, Жаханнамдан коргонуусун
        тилөөдөн алсыз калды», Жаннат болсо: «Убал буга, Жаннатты тилөөдөн алсыз
        калды», - дейт.»
        <br />
        [Табарани]
      </Typography>
      <br />
      <br />
      <Typography>
        «Таңда жана кечте 7 жолу «Аллахумма ажирни минаннар» деп айткан адам
        Жаханнамдан кутулат». [Абу Давуд] (Бул дубаны жогорудагы менен бирге
        таңда жана кечте жети жолудан окуу керек.)
      </Typography>
      <br />
      <br />
      <Typography>
        «Таңда жана кечте 3 жолу «Бисмиллахиллази ла йадурру маасмихи шайун фил
        арди вала фиссамаи ва хувассамиулалим» деп окуган адам сыйкырчы жана
        заалымдан аман болот.» [Ибни Мажа]
      </Typography>
      <br />
      <br />
      <Typography>
        «Таңда 3 жолу «Аузу биллахис-самиил алим-и минашшайтанирражим» деп Хашр
        сүрөсүнүн акыркы үч аятын окуганга 70 периште кечке чейин дуба кылат. Ал
        күнү өлсө шейит болот. Кеч окуса дагы ошол нерселерге жетет.» [Тирмизи]
      </Typography>
      <br />
      <br />
      <Typography>
        «Багымдат намазынан кийин 11 Ихлас окуганга Жаннатта бир сарай берилет.»
        [Хараити]
      </Typography>
      <br />
      <br />
      <Typography>
        «Үч нерсе өзүндө болгон адам Жаннатка тилеген эшигинен кирет: Кул акысын
        өтөгөн, ар намаздан кийин 11 жолу Ихлас сүрөсүн окуган, өзүн өлтүргөн
        адамды кечирип өлгөн адам.» [Барика]
      </Typography>
      <br />
      <br />
      <Typography>
        «Багымдат намазынан кийин он жолу «Ла илаха иллаллаху вахдаху
        ла-шарикалах лахул-мулку ва лахул-хамду йухйи ва йумит ва хува ала кулли
        шайин кадир» деп окуган кечке чейин ар түрдүү зыяндан коргонот, эч бир
        күнөө ага зыян бербейт.» [Насаи] («Күнөө зыян бербейт» деген сөз күнөө
        кылбайт же кылган күнөөгө тообо кылат, ал күнөө ага зыян бербеген болот
        дегенди билдирет.)
      </Typography>
      <br />
      <br />
      <Typography>
        «[Жогорудагы таспихти] Шам намазынан кийин окуган адам таңга чейин
        шайтандан коргонот. Он соопко жетет, он күнөөсү кечирилет жана он кул
        азат кылгандай сооп берилет.» [Тирмизи]
      </Typography>
      <br />
      <br />
      <Typography>
        «Ар күнү багымдат намазынан кийин үч жолу «Субханаллах-ил азим ва би
        хамдихи» деген адам сокурлук, жуззам жана шал дарттарынан коргонот.»
        [И.Ахмед]
      </Typography>
      <br />
      <br />
      <Typography>
        «Субханаллахи ва би-хамдихи субханаллахил-азим» таспихин таңда жана кеч
        жүз жолу окугандын күнөөлөрү кечирилет, дарттардан кутулат жана дагы
        күнөө кылуудан коргонот. (Ислам Ахлагы)
      </Typography>
      <br />
      <br />
      <Typography>
        «Ширктен коргонуу үчүн «Аллахумма инни аузу бика мин ан-ушрика бика
        шай-ан ва ана аламу ва астагфирука ли-ма ла аламу иннака анта
        алламулгуйуб» деп окугула!» [И.Ахмед]
      </Typography>
      <br />
      <br />
      <Typography>
        {' '}
        «Таңда жана кечте 7 жолу «Хасбияллаху ла илаха иллаа ху, алейхи
        таваккалту ва хува Раббул-аршил-азим» деп окугандын дүнүйө жана акырет
        ишине Аллах жетет.» [Байхаки]
      </Typography>
      <br />
      <br />
      <Typography>
        {' '}
        «Аллахумма ма асбаха би мин ниматин ав би ахадин мин халкыка, фа минка
        вахдака ла шарика лака, фалакал хамду ва лакашшукр» дубасын күндүз
        окуган адамга ошол күндүн, кеч окуган адамга ал түндүн шүгүрүн өтөгөн
        болот.» [М.Раббани 3/17] [Кеч «асбаха» ордуна «амса» делет.]
      </Typography>
      <br />
      <br />
      <Typography>
        «Кимде ким таңда-кечте жүз жолу «Субханаллахи ва бихамдихи» десе ал күнү
        жана ал кеч эч ким анчалык сооп таба албайт.» [Дайлами]
      </Typography>
    </StyleContainer>
  );
};

export default Zikr;

const StyleContainer = styled(Container)(() => ({
  textAlign: 'center',
  padding: '1rem',
}));

const StyleBannerText = styled('div')(() => ({
  fontSize: '2rem',
  padding: '2rem',
}));
