import { Container, Typography, styled } from '@mui/material';
import React from 'react';

const Zikr = () => {
  return (
    <StyleContainer>
      <StyleBannerText>
        <h2>Ар күн окула турчу дубалар</h2>
      </StyleBannerText>
      <Typography>
        «Намаздан кийин дуба кылууда{' '}
        <b>«Аллахумма ажирни минаннар ва адхылнил Жанната»</b> деп окубаса
        периштелер: «Убал буга, Жаханнамдан коргонуусун тилөөдөн алсыз калды»,
        Жаннат болсо: «Убал буга, Жаннатты тилөөдөн алсыз калды», - дейт.»
        <br />
        [Табарани]
      </Typography>
      <br />
      <br />
      <Typography>
        «Таңда жана кечте 7 жолу «Аллахумма ажирни минаннар» деп айткан адам
        Жаханнамдан кутулат».
        <br />
        (Бул дубаны жогорудагы менен бирге таңда жана кечте жети жолудан окуу
        керек.)
        <br /> [Абу Давуд]
      </Typography>
      <br />
      <br />
      <Typography>
        «Таңда жана кечте 3 жолу <br />
        <b>
          «Бисмиллахиллази ла йадурру маасмихи шайун фил арди вала фиссамаи ва
          хувассамиулалим»
        </b>
        деп окуган адам сыйкырчы жана заалымдан аман болот.» <br /> [Ибни Мажа]
      </Typography>
      <br />
      <br />
      <Typography>
        «Таңда 3 жолу <br />{' '}
        <b>
          «Аузу биллахис-самиил алим-и минашшайтанирражим» деп Хашр сүрөсүнүн
          акыркы үч аятын окуганга 70 периште кечке чейин дуба кылат.{' '}
        </b>
        Ал күнү өлсө шейит болот. Кеч окуса дагы ошол нерселерге жетет.»
        <br />
        [Тирмизи]
      </Typography>
      <br />
      <br />
      <Typography>
        <b>
          «Багымдат намазынан кийин 11 Ихлас окуганга Жаннатта бир сарай
          берилет.»
        </b>
        <br />
        [Хараити]
      </Typography>
      <br />
      <br />
      <Typography>
        «Үч нерсе өзүндө болгон адам Жаннатка тилеген эшигинен кирет: <br />{' '}
        <b>
          Кул акысын өтөгөн, ар намаздан кийин 11 жолу Ихлас сүрөсүн окуган,
          өзүн өлтүргөн адамды кечирип өлгөн адам.»
        </b>
        <br /> [Барика]
      </Typography>
      <br />
      <br />
      <Typography>
        «Багымдат намазынан кийин он жолу <br />{' '}
        <b>
          «Ла илаха иллаллаху вахдаху ла-шарикалах лахул-мулку ва лахул-хамду
          йухйи ва йумит ва хува ала кулли шайин кадир»
        </b>
        <br /> деп окуган кечке чейин ар түрдүү зыяндан коргонот, эч бир күнөө
        ага зыян бербейт.» <br />
        («Күнөө зыян бербейт» деген сөз күнөө кылбайт же кылган күнөөгө тообо
        кылат, ал күнөө ага зыян бербеген болот дегенди билдирет.)
        <br />
        [Насаи]
      </Typography>
      <br />
      <br />
      <Typography>
        «[Жогорудагы таспихти] Шам намазынан кийин окуган адам таңга чейин
        шайтандан коргонот. Он соопко жетет, он күнөөсү кечирилет жана он кул
        азат кылгандай сооп берилет.»
        <br /> [Тирмизи]
      </Typography>
      <br />
      <br />
      <Typography>
        «Ар күнү багымдат намазынан кийин үч жолу <br />
        <b>«Субханаллах-ил азим ва би хамдихи»</b>
        <br /> деген адам сокурлук, жуззам жана шал дарттарынан коргонот.»
        <br />
        [И.Ахмед]
      </Typography>
      <br />
      <br />
      <Typography>
        <b>«Субханаллахи ва би-хамдихи субханаллахил-азим» </b> <br />
        таспихин таңда жана кеч жүз жолу окугандын күнөөлөрү кечирилет,
        дарттардан кутулат жана дагы күнөө кылуудан коргонот
        <div className="br"></div> (Ислам Ахлагы)
      </Typography>
      <br />
      <br />
      <Typography>
        «Ширктен коргонуу үчүн <br />{' '}
        <b>
          «Аллахумма инни аузу бика мин ан-ушрика бика шай-ан ва ана аламу ва
          астагфирука ли-ма ла аламу иннака анта алламулгуйуб»{' '}
        </b>
        <br /> деп окугула!»
        <br />
        [И.Ахмед]
      </Typography>
      <br />
      <br />
      <Typography>
        {' '}
        «Таңда жана кечте 7 жолу <br />
        <b>
          «Хасбияллаху ла илаха иллаа ху, алейхи таваккалту ва хува
          Раббул-аршил-азим» деп окугандын дүнүйө жана акырет ишине Аллах
          жетет.»{' '}
        </b>{' '}
        <br /> [Байхаки]
      </Typography>
      <br />
      <br />
      <Typography>
        {' '}
        <b>
          «Аллахумма ма асбаха би мин ниматин ав би ахадин мин халкыка, фа минка
          вахдака ла шарика лака, фалакал хамду ва лакашшукр» <br /> дубасын
          күндүз окуган адамга ошол күндүн, кеч окуган адамга ал түндүн шүгүрүн
          өтөгөн болот.»
        </b>{' '}
        <br /> [М.Раббани 3/17] <br />
        [Кеч «асбаха» ордуна «амса» делет.]
      </Typography>
      <br />
      <br />
      <Typography>
        «Кимде ким таңда-кечте жүз жолу
        <br /> <b>«Субханаллахи ва бихамдихи» </b> десе ал күнү жана ал кеч эч
        ким анчалык сооп таба албайт.» <br /> [Дайлами]
      </Typography>
    </StyleContainer>
  );
};

export default Zikr;

const StyleContainer = styled(Container)(() => ({
  textAlign: 'center',
  padding: '1rem',
}));

const StyleBannerText = styled('div')(() => ({
  fontSize: '2rem',
  padding: '2rem',
}));
