import { Container, Typography } from '@mui/material';
import React from 'react';

const Asr = () => {
  return (
    <Container>
      <div>
        <h1>Аср намазынын окулушу</h1>
        <br />
        <br />
        <h2> 4 Рекет парздын окулушу</h2>
        <br />
        <br />
        <Typography>
          Камат айтылат. - Такбир айтылат. - Субханака окулат. -
          Аъузу...-бисмиллах.... - Фатиха сүрөсү окулат. - Бир сүрө (зам сүрө)
          окулат. - Рукуга ийилет. - Саждага барат. Экинчи рекетке турулат.
          <br />
          <br /> - Бисмиллах..... - Фатиха сүрөсү окулат. - Бир сүрө (зам сүрө)
          окулат. - Рукуга ийилет. - Саждага барат. - Отурулат. - Аттахияту
          окулат. Үчүнчү Рекетке турулат.
          <br />
          <br /> - Бисмиллах..... - Фатиха сүрөсү окулат. - Рукуга ийилет. -
          Саждага барат. Төртүнчү Рекетке турулат.
          <br />
          <br /> - Бисмиллах..... - Фатиха сүрөсү окулат. - Рукуга ийилет. -
          Саждага барат. - Отурулат. (соңку) - Аттахияту окулат. - Аллахумма
          салли,Аллахумма барик дубалары окулат. - Раббана атина... дубасын
          окуйт. - Салам берилет. «Аллахумма антас-салам ва минкас-салам
          табаракта йа зал жалали вал икрам» – деп окулат. Намаздан кийин үч
          жолу «Астагфируллах» дегенден соң «Аятул курси» жана отуз үч таспих
          (субханаллах), отуз үч тахмид (алхамдүлиллах), отуз үч такбир (Аллаху
          акбар) жана бир тахлил (Ла илаха иллаллаху вахдаху ла шарика лах.
          Лахул мүлкү ва лахул хамду ва хува ала кулли шайин кадир) окулат.
          Буларды ар ким өзү уга тургандай үн менен окуйт. Үндү чыгарып окуу
          бидат болуп саналат.
        </Typography>
      </div>
    </Container>
  );
};

export default Asr;
