import { Container } from '@mui/material';
import React from 'react';

const Bagymdat = () => {
  return (
    <Container>
      <h1>Багымдат намазынын окулушу</h1>
      <br />
      <div>
        <div>
          <h2>2 Рекет сүннөттүн окулушу</h2>
          <br />
          <br />
          <div>
            1. Рекет - Ниет кылынат. - Такбир айтылат. - Субханака окулат. -
            Аъузу...-бисмиллах.... - Фатиха сүрөсү окулат. - Бир сүрө (зам сүрө)
            окулат. - Рукуга ийилет. - Саждага барат. Экинчи рекетке турулат.
          </div>
          <br />
          <br />
          <div>
            2.Рекет - Бисмиллах….. - Фатиха сүрөсү окулат. - Бир сүрө (зам сүрө)
            окулат. - Рукуга ийилет. - Саждага барат. - Отурулат. - Аттахияту
            окулат. - Аллахумма салли, Аллахумма барик дубалары окулат. -
            Раббана атина... дубасын окуйт. - Салам берилет. Салам бергенден
            кийин «Аллахумма антас-салам ва минкас-салам табаракта йа зал жалали
            вал икрам» – дегенден кийин эч нерсе сүйлөбөстөн багымдат намазынын
            парзын окуу үчүн ордунан турат. Анткени, сүннөт менен парз намазынын
            арасында сүйлөө намазды бузбаса да сообун азайтат.
          </div>
        </div>
        <br />
        <div>
          <h2>2 Рекет парздын окулушу</h2>
          <br />
          <br />
          <div>
            1. Рекет Камат айтылат. - Такбир айтылат. - Субханака окулат. -
            Аъузу...-бисмиллах.... - Фатиха сүрөсү окулат. - Бир сүрө (зам сүрө)
            окулат. - Рукуга ийилет. - Саждага барат. Экинчи рекетке турулат.
          </div>
          <br />
          <br />
          <div>
            2.Рекет - Бисмиллах….. - Фатиха сүрөсү окулат. - Бир сүрө (зам сүрө)
            окулат. - Рукуга ийилет. - Саждага барат. - Отурулат. (соңку) -
            Аттахияту окулат. - Аллахумма салли,Аллахумма барик дубалары окулат.
            - Раббана атина... дубасын окуйт. - Салам берилет. Салам бергенден
            кийин «Аллахумма антас-салам ва минкас-салам табаракта йа зал жалали
            вал икрам» – деп окулат. Намаздан кийин үч жолу «Астагфируллах»
            дегенден соң «Аятул курси» жанаотуз үч таспих (субханаллах), отуз үч
            тахмид (алхамдүлиллах), отуз үч такбир (Аллаху акбар) жана бир
            тахлил (Ла илаха иллаллаху вахдаху ла шарика лах. Лахул мүлкү ва
            лахул хамду ва хува ала кулли шайин кадир) окулат. Буларды ар ким
            өзү уга тургандай үн менен окуйт. Үндү чыгарып окуу бидат болуп
            саналат.
          </div>
        </div>
      </div>
    </Container>
  );
};

export default Bagymdat;
