import React from 'react';
import Typography from '@mui/material/Typography';
import { Container, styled } from '@mui/material';

const Istihara = () => {
  return (
    <StyleContainer>
      <Typography variant="h5" gutterBottom>
        Истихара намазы - кандайдыр бир ишке кадам шилтей албай турганда
        (мисалы, үйлөнүү, машине сатып алуу жана башка ушул сыяктуу иштер), же
        кадам шилтегенден кийин деле Кудурети күчтүү Аллах Тааладан жардам жана
        туура жол тиленип окулуучу намаз.
      </Typography>
      <Typography variant="body1" gutterBottom>
        Истихара намазынын маңызы Аллах Тааладан жардам сурап, ага тобокел
        кылуу. Истихара намазын окуган адам Аллах Тааланын чечимине (ал кандай
        гана чечим болбосун) ыраазы болуп, ар дайым шүгүр кылууга үйрөнөт.
        Анткени айрым же көпчүлүк учурларда биздин каалообуз аткарылбай, баары
        тескерисинен чыгышы мүмкүн. Бирок дал ушундай чечим биз үчүн пайдалуу
        болгонун биз убакыт өткөндө гана түшүнөбүз.
      </Typography>
      <Typography variant="body1" gutterBottom>
        Аллах Таала Ыйык Куранда: “...Силер эмнегедир жаман көрөсүңөр, (бирок)
        ал силер үчүн жакшы. Силер кандайдыр бир нерсени жаман көрөсүңөр,
        (бирок) ал силер үчүн жаман. Аллах билет. Силер билбейсиңер”, - деп
        айткан.
      </Typography>
      <Typography variant="body1" gutterBottom>
        Истихара намазы кайсы убакта окулат?
      </Typography>
      <Typography variant="body1" gutterBottom>
        Истихара намазын 3 учурдан башка (күн чыгып келе жаткан учур, чак түш
        жана күн батып бара жаткан кез) каалаган убагында окуй берсе болот. Эл
        арасында истихараны окуган соң сөзсүз укташ керек же уктар алдында окуш
        керек деген жаңылыш пикирлер тарап кеткен. Буга байланыштуу айрым такыба
        адамдардын истихараны кечинде уктар алдында окуганы гана айтылат.
      </Typography>
      <Typography variant="body1" gutterBottom>
        Кантип окулат?
      </Typography>
      <Typography variant="body1" gutterBottom>
        Намаздын башында “Истихара намазынын баланча рекетин окууга Аллах
        ыраазычылыгы үчүн ниет кылдым” деп айтылат. Истихара намазын эң аз 2
        рекет окуу сүннөт болуп эсептелинет. Рекеттердин санын көбөйтүүгө болот.
      </Typography>
      <Typography variant="body1" gutterBottom>
        Кайсы сүрөлөрдү окуган жакшыраак?
      </Typography>
      <Typography variant="body1" gutterBottom>
        Биринчи рекетинде зам сүрө катары «Каафирун», экинчи рекетинде «Ихлас»
        сүрөсүн окуган жакшы. Намаздан кийин истихара дубасы окулат.
      </Typography>
      <Typography variant="body1" gutterBottom>
        Истихара дубасы 2 жакка салам берген соң айтылат:
      </Typography>
      <Typography variant="body1" gutterBottom>
        «Аллахума инни астахийрука би-илмика ва астакдирука бикудратика ва
        ас-алука мин фадликал азиим. Фаиннака такдиру ва лаа акдиру ва таьламу
        ва лаа аьламу ва анта алламул гуюуб. Аллахумма ин кунта таьламу анна
        хаазал амра хайрун ли фии диини ва маьаши ва аакибати амри (ав ьаажили
        амри ва аажилихи) факдирху ли ва яссирху ли сумма баарик ли фийхи, Ва ин
        кунта таьламу анна хаазал амра шаррун ли фии диини ва маьаши ва
        ьаакибати амри (ав ьаажилихи ва аажилихи) фасрифху ьанни вакдур лиял
        хайра хайсу каана сумма ардини бих».
      </Typography>
      <Typography variant="body1" gutterBottom>
        Мааниси:
      </Typography>
      <Typography variant="body1" gutterBottom>
        «Оо, Аллахым! Сен билгениң үчүн, иштин жакшылык белгисин Сенден
        тилеймин, күч кудуретиңе сүйөнүп, Сенден кубат-кайрат сураймын.
        Жакшылыкка жетүүмдү Сенин эбегейсиз берешен кайрымдуулугуңдан суранам.
        Анткени Сенин ар нерсеге алың жетет, менин колумдан эч нерсе келбейт.
        Сен баарын билесиң, мен билбеймин. Көмүскө ааламдын сырларын билген
        жалгыз өзүңсүн!
      </Typography>
      <Typography variant="body1" gutterBottom>
        Оо, Аллахым! Ушул иш менин диниме, жашоомо, ишимдин артына же
        дүйнө-акыретиме пайдалуу болсо, муну мага насип кыл. Андан кийин мага
        ушунун берекесин бер.
      </Typography>
      <Typography variant="body1" gutterBottom>
        Эгерде ушул иш менин диниме, жашоомо, ишимдин акыр-аягына же
        дүйнө-акыретиме зыяндуу болсо, муну мага жолотпо. Мени да мындайга туш
        кылба, жан дүйнөмдөн аны алыс кыл жана мага жакшылыкты кайда болсо да
        насип кыл. Ошону менен мени ыраазы кыл». («Ушул иш» деген жерде ар ким
        өзүнүн көздөгөн максатын айтуусу керек). (Бухари “Сахих”: ад-Даъават,
        6019).
      </Typography>
      <Typography variant="body1" gutterBottom>
        Ошондой эле, мусулман баласы өзү чече албаган кайсы бир маанилүү ишин
        чечүү үчүн иштин көзүн билген жана ишенимдүү адамдар менен кеңешүүсү
        жакшы болот. Бул машура деп аталып, сүннөт амал болуп эсептелинет.
      </Typography>
      <Typography variant="body1" gutterBottom>
        Истихара намазынан кийин түш көрүүнү, же кандайдыр бир белгини күтүү
        керекпи?
      </Typography>
      <Typography variant="body1" gutterBottom>
        Көпчүлүгү истихара намазынан соң кандайдыр бир түштү, же өзгөчө белгини
        күтүшөт. Бирок бул - жаңылыштык. Анткени бир дагы хадисте истихара менен
        түшкө байланыштуу нерсе айтылган эмес. Эгерде кечинде жатардан мурун
        истихара окуп, анан түш көрсө, ал кадимки гана түштөрдүн катарына кирет.
      </Typography>
      <Typography variant="body1" gutterBottom>
        Кандайдыр бир иште эки анжы болуп жаткан адам истихара намазын окуган
        соң жасап жаткан ишин уланта бериши керек. Эгер Аллах Таала ал ишти
        пендесине жакшылык алып келе тургандай кылса, иш оңой болуп жүрүшүп кете
        берет. Ал эми ал иште эч кандай береке болбосо, анда Аллах Таала
        пендесин андан четтеткен болот.
      </Typography>
      <Typography variant="body1" gutterBottom>
        Истихара намазын кайсы бир ишти баштоодо гана эмес, баштап койгондон
        кийин да окуса болот.
      </Typography>
      <Typography variant="body1" gutterBottom>
        Имам Газали мындай деп айткан: Төрт нерсени орундаган адам төрт нерседен
        куру калбайт: 1- Шүгүр кылган адам жакшылыктын артуусунан, 2- Тообо
        кылган адам кабыл болуусунан, 3- Истихара кылган адам жакшылыктан, 4-
        Истишара кылган (кеңешкен) адам туураны табуудан, акыйкатка жетүүдөн
        куру калбайт. Жаттай албай жатам... Балким сиз истихара намазын истихара
        дубасын жаттай албай жаткан үчүн окубай жүрүшүңүз мүмкүн. Бирок бул -
        шылтоо эмес. Анткени сиз дубаны кагазга жазып алып, окуп айтсаңыз да
        болот. Бирок эң жакшысы дубаны жаттап алуу керек экенин унутпаңыз.
      </Typography>
      <Typography variant="body1" gutterBottom>
        Истихара – Аллахка тобокел кылуунуну мыкты аракети. Бул маанилүү сүннөтү
        аткарууга кайдыгер карабайлы.
      </Typography>
      <Typography>
        <b>
          Истихара дубасы: «Аллахума инни астахийрука би-илмика ва астакдирука
          бикудратика ва ас-алука мин фадликал азиим. Фаиннака такдиру ва лаа
          акдиру ва таьламу ва лаа аьламу ва анта алламул гуюуб. Аллахумма ин
          кунта таьламу анна хаазал амра хайрун ли фии диини ва маьаши ва
          аакибати амри (ав ьаажили амри ва аажилихи) факдирху ли ва яссирху ли
          сумма баарик ли фийхи, Ва ин кунта таьламу анна хаазал амра шаррун ли
          фии диини ва маьаши ва ьаакибати амри (ав ьаажилихи ва аажилихи)
          фасрифху ьанни вакдур лиял хайра хайсу каана сумма ардини бих».
          Мааниси: «Оо, Аллахым! Сен билгениң үчүн, иштин жакшылык белгисин
          Сенден тилеймин, күч кудуретиңе сүйөнүп, Сенден кубат-кайрат сураймын.
          Жакшылыкка жетүүмдү Сенин эбегейсиз берешен кайрымдуулугуңдан суранам.
          Анткени Сенин ар нерсеге алың жетет, менин колумдан эч нерсе келбейт.
          Сен баарын билесиң, мен билбеймин. Көмүскө ааламдын сырларын билген
          жалгыз өзүңсүн! Оо, Аллахым! Ушул иш менин диниме, жашоомо, ишимдин
          артына же дүйнө-акыретиме пайдалуу болсо, муну мага насип кыл. Андан
          кийин мага ушунун берекесин бер. Эгерде ушул иш менин диниме, жашоомо,
          ишимдин акыр-аягына же дүйнө-акыретиме зыяндуу болсо, муну мага
          жолотпо. Мени да мындайга туш кылба, жан дүйнөмдөн аны алыс кыл жана
          мага жакшылыкты кайда болсо да насип кыл. Ошону менен мени ыраазы
          кыл». («Ушул иш» деген жерде ар ким өзүнүн көздөгөн максатын айтуусу
          керек).
        </b>
      </Typography>
    </StyleContainer>
  );
};

export default Istihara;

const StyleContainer = styled(Container)(() => ({
  textAlign: 'center',
  padding: '1rem',
}));
