import React from 'react';
import { Container, Typography } from '@mui/material';

const JanazaNamaz = () => {
  return (
    <Container>
      <Typography variant="h2">Жаназа намазы</Typography>
      <Typography variant="body1">
        Жаназа намазы төмөнкүчө окулат. Жаназа намаз төрт такбирден жана кыямдан
        (тике туруп окудан) турат. Бул намазда сажда да, руку да кылынбайт.
        Жаназа намазынын төрт такбиринин ар бири бир рекет сыяктуу. Төрт
        такбирдин биринчисинде гана кулак кагылат. Андан кийинки үч такбирде
        кулак кагылбастан такбир айтылат. 1. Ниет кылдым ушул маркум (аялдын)
        жаназа намазын окумакка, жүзүмдү бурдум кыбылага, уюудум ушул имамга. 2.
        "Аллооху Акбар" - деп эки кол кулак жумушактарына чейин көтөрүп такбир
        айтылат. 3. Оң кол сол колдун үстүнө коюлуп киндиктин астына байланат.
        Бул акыбалда төмөнкүлөр окулат: A) Субхаанака аллоохумма уа бихамдика,
        уа табаарокасмука, уа таалаа жаддука, уа лаа илааха гойрук. 4. Кийин
        колду көтөрбөстөн"Аллооху Акбар" деп 2-такбир айтылат 5. Андан соң
        Аллоохумма солли алаа Мухаммадин уа алаа аали Мухаммад Камаа соллайта
        алаа Иброохиима уа алаа аали Иброохима Иннака хамиидум-мажиид Аллоохумма
        баарик алаа Мухаммадин уа алаа аали Мухаммад Камаа баарокта алаа
        Иброохиима уа алаа аали Иброохима Иннака хамиидум-мажиид. 6. Колдорду
        көтөрбөстөн"Аллооху Акбар" деп 3-такбир айтылат 7. Андан соң жаназа
        дубасы окулат. (Жаназа дубасын жаттай электер ордуна «Раббана атина»
        дубасын окуйт же «Аллахуммагфирли» деп 3 ирет айтат, же болбосо дуба
        ниети менен Фатиха сүрөөсүн окуйт). Эркек маркум үчүн окула турган дуба:
        Аллахумма-гъфир ли-хайи-на, уа майити-на, уа шахиди-на, уа гъа иби-на,
        уа сагъыри-на, уа кабири-на, уа-закари-на уа уңса-на! Аллахумма, ман
        ахйайта-ху мин-на, фа ахъйи-хи ‘аля-ль-ислям, уа манн тауаффайта-ху
        мин-на, фа тауаффа-ху ‘ъала-ль-иман. Аллахумма, ин кяна мухсинан фа зид
        фии ихсаанихи, ва ин кяна мусииан фатажааваз ‘анху Аял маркум үчүн окула
        турган дуба: Аллахумма-гъфир ли-хайи-на, уа майити-на, уа шахиди-на, уа
        гъа иби-на, уа сагъыри-на, уа кабири-на, уа-закари-на уа уңса-на!
        Аллахумма, ман ахйайта-ху мин-на, фа ахъйи-хи ‘аля-ль-ислям, уа манн
        тауаффайта-ху мин-на, фа тауаффа-ху ‘ъала-ль-иман. Аллахумма, ин кянат
        мухсинатан фа зид фии ихсаанихаа, ва ин кяна мусииатан фатажааваз анхаа
        Наристе кыз маркум үчүн окула турган дуба: Аллахумма, иж ‘аль ха лянаа
        фаротон ва зухрон важ-аль ха лянаа шаафиатан ва мушаффиатан Наристе
        эркек маркум үчүн окула турган дуба: Аллахумма, иж ‘аль-ху лянаа фаротон
        ва зухрон важ-аль ху лянаа шаафиан ва мушаффаан 8. Колдорду
        көтөрбөстөн"Аллооху Акбар" деп 4-такбир айтылат 9."Ассалааму алайкум уа
        рохматуллох" - деп оң тарапка салам берилет, жана ушундай эле сол ийинге
        "Ассалааму алайкум уа рохматуллох" деп -салам берилет. Имам төрт
        такбирди, оң жана сол ийинге берилген саламды гана үнүн чыгарып айтат,
        калган жерлерде ичинен окуйт. Ошентип жаназа намазы соңуна чыгат.
      </Typography>
    </Container>
  );
};

export default JanazaNamaz;
