import { Container, Typography } from '@mui/material';
import React from 'react';
import styled from 'styled-components';

const Jannat = () => {
  return (
    <StyleContainer>
      <Content>
        <StyledHeader>Намаз Аллах Тааланын буйругу</StyledHeader>
        <Typography paragraph>
          Аллах Таала Куранда: “Аллах жана Анын элчиси бир ишти буйруган убакта,
          момун эркек жана момун аял үчүн Аллахтын өкүмүн таштап өз иштеринен
          бир ишти тандоо уруксат эмес. ( ал- Ахзаб: 36) <br />
          <br />
          Аллах Таала Куранда: Алар бардык ибадаттарды калыс Аллах үчүн гана
          кылууга, андан (жеке кудайга сыйынуудан) башка динден жүз бурууга,
          намаз окууга, зекет берүүгө буюрулушкан эле жана дал ушул гана Туура
          Дин ! (Баййина: 5) <br />
          <br />
          Ошондой эле: Эй Мухаммад Ыйман келтирген пенделериме айткын: Намаз
          окушсун.. ( Иброхим: 31)
        </Typography>
        <Typography paragraph>
          “Намаз окугула, зекет бергиле жана рүкү кылуучулар менен рүкү кылгыла”
          (Бакара 43)
        </Typography>

        <StyledHeader>Намаздын Убакыттары</StyledHeader>
        <Typography paragraph>
          <Typography>
            Багымдат намазынын убагы: Таң агараардан баштап кун чыкканга чейин
          </Typography>
          <Typography>
            Бешим намазынын убагы: кун чак туштон бир аз откондон тартып аср
            намазынын убактысы киргенге чейинки аралык
          </Typography>
          <Typography>
            Аср намазынын убагы: кут батууга эки саатча калгандан тартып
            батканга чейинки аралык
          </Typography>
          <Typography>
            Шам намазынын убагы: кун толук баткандан тартып горизонттогу кундун
            кызыл шооласы кеткенге чейинки аралык
          </Typography>
          <Typography>
            Куптан намазынын убагы: шам намазынын убактысы толук буткондот
            баштап багымдат намазынын убагы киргенге чейинки аралык
          </Typography>
          <StyledHeader>Жума намазыынын убагы</StyledHeader>
          <Typography>
            Бешим намазынын убагы киргенде окулат Орозо айт жана курман айт
            намаздарынын убактары кун эки найза боюу которулгондон баштап бешим
            намазыынын убагы киргенге чейин окулат
          </Typography>
          <StyledHeader>Эскертме</StyledHeader>
          <Typography>Томонку убактарда намаз окулбайт</Typography>
          <Typography>Эртен менен кун жаныдан которулуп жатканда</Typography>
          <Typography>Кун чак тушко келгенде</Typography>
          <Typography>Кун батаарда</Typography>
        </Typography>

        <StyledHeader>Намаздын Рекеттери</StyledHeader>
        <Typography paragraph>
          Багымдат намазы: 2 рекет суннот 2 рекет парз
        </Typography>
        <Typography paragraph>
          Бешим намазы: 4 рекет суннот 4 рекет парз 2 рекет суннот
        </Typography>
        <Typography paragraph>Аср намазы: 4 рекет парз</Typography>
        <Typography paragraph>
          Шам намазы: 3 рекет парз 2 рекет суннот
        </Typography>
        <Typography paragraph>
          Куптан намазы: 4 рекет парз 2 рекет суннот 3 рекет витир важиб
        </Typography>

        <StyledHeader>Намазды бузуучу нерселер</StyledHeader>
        <Typography paragraph>
          Намазда суйлоо
          <br />
          намаз окуп жатканда бироого атайын салам айтуу же алик алуу
          <br />
          онтоо жана ушул сыяктуу ундорду чыгаруу
          <br />
          ун чыгарып ыйлоо бирок акыретти эстеп ыйласа болот
          <br />
          чучкурго адамга жооп беруу
          <br />
          себепсиз жотолуп тамакты тазалоо башача айтканда тамактагы нерселреди
          чыгаруу
          <br />
          созго жооп беруу зирк хади куран аяты менен болсо да жооп берилбейт
          <br />
          имамдан башка жанында турган адамдын катасын ондоо
          <br />
          куранды карап окуу эгер намазды жаны уйронуп жатса уйронгучо карап
          окуса болот
          <br />
          ыплас жерде сажда кылуу
          <br />
          адамдардан суралуучу нерселер менен дуба кылуу
          <br />
          жеп ичуу
          <br />
          эки кол менен жасалуучу ашыкча кыймыл мисалы тырмануу сыяктуу
        </Typography>
      </Content>
    </StyleContainer>
  );
};

export default Jannat;

const StyleContainer = styled(Container)({
  padding: '1rem',
});

const Content = styled.div`
  text-align: center;
`;

const StyledHeader = styled.h2`
  margin-top: 2rem;
  margin-bottom: 1rem;
`;
