import { Container, styled } from '@mui/material';
import React from 'react';

const KunAiNamazy = () => {
  return (
    <StyleContainer>
      <StyleBannerText>
        <h2>КУСУФ НАМАЗЫ:</h2>
      </StyleBannerText>
      <div>
        Арап тилинде күндүн тутулушу «Кусуф» деп айтылат. Пайгамбарыбыз күн
        тутулган учурларда эки ирекет намаз окуп Жараткан Аллага дуба кылган.
        Кусуф намазы жамаат менен окулат. Күн тутулган жерде жума намазын окутчу
        адам азансыз жана кооматсыз эки рекет намазды элге окутат. Хутба
        окулбайт. Ар бир ирекетте узун сүрөлөрдөн окулат. Намаздын акырында имам
        өйдө турган калыбында алакан жая Жаратканга дуба кылат. Имам жок болсо,
        ар ким өз үйүндө жалгыз окуса болот. Бул намазды жеке окуса да болот.
      </div>
      <StyleSpacer />
      <div>
        <StyleBannerText2>
          <h2>ХУСУФ НАМАЗЫ:</h2>
        </StyleBannerText2>
        Ай тутулган кезде кээ бир аалымдардын пикиринде, эки ирекет намаз окуп
        дуба кылуу мустахап. Айдын тутулуусун «хусуф» деп аталат. Ай тутулган
        кезде мусулмандар үйлөрүндө кудум «кусуф намазы» сыяктуу купуя же жарыя
        үн менен эки же төрт рекет намаз окуулары мустахаб. Имам Абу Ханифа
        боюнча бул намаздын мечитте жамаат менен окулушу сүннөттө жок. Бирок
        ушундай окулса дурус. Ай тутулуу түндөсү болгонуна байланыштуу жамааттын
        мечитке жыйналышы кыйынчылык жаратат. Жер титирөө, чагылган,
        бороон-чапкын болгон учурларда да эки ирекет намаз окуп Аллага дуба
        кылуу мустахап болуп эсептелет. Бул кусуф намазына кыяс кылынып
        айтылган. Пайгамбарыбыз (САВ) катуу бороон болгондо Алла Таалага
        жалбарып дуба кылганы баяндалган. (Муслим, Истиска, 15) Күнүбүздө айрым
        өлкөлөрдө болуучу цунами, тайфун бороону, жер титирөө сыяктуу миңдеген
        адамдардын өмүрүн кыйган орошон окуялар да пайгамбарыбыздын (САВ)
        дубасынын маңызын ан сайын айкындап берүүдө. Мындай абалдардан Алла
        Тааладан жардам суроодон башка арга жок экендиги белгилүү. Албетте
        колдон келишинче алдын алуу чараларын көрүү, айрыкча ар дайым Алла
        Тааланын буйруктарын аткара билүү зарыл.
      </div>
    </StyleContainer>
  );
};

export default KunAiNamazy;

const StyleContainer = styled(Container)(() => ({
  textAlign: 'center',
  padding: '1rem',
}));
const StyleBannerText = styled('div')(() => ({
  textAlign: 'center',
  paddingBottom: '1rem',
}));
const StyleBannerText2 = styled('div')(() => ({
  textAlign: 'center',
  paddingBottom: '1rem',
  paddingTop: '1rem',
}));

const StyleSpacer = styled('div')(() => ({
  height: '2rem',
}));
