import { Container, Typography, styled } from '@mui/material';
import React from 'react';

const KurmanaitNamaz = () => {
  return (
    <StyleContainer>
      <h2>Курман айт намазы</h2>
      <Typography>
        <p>
          Орозо айтта намаздан мурун таттуу нерсе (хурма же момпосуй) жеш; гусул
          алуу, мисвак колдонуу, эң жакшы кийимдерди кийүү, жолдо акырын такбир
          окуу мустахаб.
        </p>
      </Typography>
      <Typography>
        <p>
          Курман айтта намаздан мурун эч нерсе жебөө, намаздан кийин курмандыкка
          чалынган малдын этин жеш, намазга баратканда үнүн катуу чыгарып,
          (кандайдыр бир сыркоосу бар адам акырын чыгарса да болот) такбир окуу
          мустахаб.
        </p>
      </Typography>
      <Typography>
        <p>
          Айт намаздары эки рекеттен турат. Жалгыз окулбастан, жамаат менен
          бирге окулат.
        </p>
        <h3>Айт намазы кантип окулат?</h3>
      </Typography>
      <Typography>
        Адегенде: «Ниет кылдым важиб болгон Айт намазын окууга, уюудум даяр
        болгон имамга», - деп ниет кылып, намазга турулат. Анан «Субханака»
        окулат. Субханакадан кийин үч жолу такбир кылынып, кулак кагылат.
        Биринчи жана экинчи такбирден кийин колдор ылдый түшүрүлөт. Ал эми
        үчүнчү такбирден кийин колдор байланат. Имам алгач Фатиха, анан бир сүрө
        окуйт, анан чогуу рукуга ийилишет. Экинчи рекетте имам алгач Фатиха жана
        бир сүрө окуйт. Анан такбир кылынып үч жолу кулак кагылат. Төртүнчү
        такбирде колдор көтөрүлүп кулак кагылбастан рукуга ийилет.
      </Typography>
      <Typography>
        <b>
          Кыскача: «Эки ташта, бир байла; үч ташта, бир ийил!» деп жаттап алууга
          болот.{' '}
        </b>
      </Typography>
    </StyleContainer>
  );
};

export default KurmanaitNamaz;

const StyleContainer = styled(Container)(() => ({
  color: 'black',
  textAlign: 'center',
  padding: '1rem',
}));
