import { Container, styled } from '@mui/material';
import React from 'react';

const MechitNamazy = () => {
  return (
    <StyleContainer>
      <h2>ТАХИЯТУЛ МАСЖИД (МЕЧИТКЕ САЛАМ)</h2>
      <div>
        Мечитке кирген адамдар үчүн мечиттин ээси болгон Алла Таалага баш ийип
        салам берүү катары эки рекет намаз окуу мустахаб. Бир күндө намаз үчүн
        жана андан башка ар түрдүү себептер менен мечитке кайра-кайра кирген
        адам бул намазды башында киргенде, же башкасында бир ирет окуса жетиштүү
        болот. Бул намазды мечитке кирээри менен отурбастан окуу абзел. Отуруп
        бир аздан кийин окуса да болот. Пайгамбарыбыз (САВ) мындай деген:
        «Бирөөңөр мечитке киргенде, эки рекет намаз окубастан отурбагыла».
        (Бухари, Салат 60) Бир мечитке ар кандай намазды окуу үчүн же парз
        намазды имамга уюп окуу ниети менен кирүү да «мечитке салам» намазынын
        ордунда өтөт. Жума күнү имам хутба айтып жаткан кезде кирген адам бул
        намазды окубастан олтуруп, хутбага кулак салуусу керек.
      </div>
    </StyleContainer>
  );
};

export default MechitNamazy;

const StyleContainer = styled(Container)(() => ({
  textAlign: 'center',
  padding: '1rem',
}));
