import React from 'react';
import { Container, Typography, styled } from '@mui/material';

const NafilNamaz = () => {
  return (
    <StyleContainer>
      <Typography variant="h2">Нафил намазы</Typography>
      <StyleText>
        <h2>~НАФИЛ НАМАЗДАР~ </h2>
      </StyleText>
      <Typography variant="body1">
        Алла Таала бир хадиси кудсииде мындай деит: «Кимде-ким менин олуя кулума
        душмандык кылса, мен ага согуш жарыялайм. Кулумду мага жакындаткан
        нерселердин ичинен анын парз болгон нерселерди орундатуусу мага көбyрөөк
        жагат. Ошондой эле кулум мага нафил ибадаттары менен да жакындап, менин
        сyйyyмө татыктуу болот. Аны бир жолу сyйгөнyмдөн кииин, анын көрөр
        көзy,угар кулагы, кармар колу, басар буту (сезер жyрөгy, сyйлөр тили)
        болом. Менден бир нерсе сураса, беремин, корго десе, коргоймун. Мен кыла
        турган ишимде момун кулумдун жанын алууда тyйшөлгөнчөлyк тyйшөлгөн
        эмесмин. Ал өлyмдy жактырбайт, мен да ал жактырбаган нерсени
        жактырбайм.» (Бухарии, Рикак, 38) Бул себептен улам салих момундар
        парздарга кошумча кылып сапарга чыгарда, корккон учурларында; бир
        нерсеге муктаж болгондо; тyнкy убакыттарда жана башка учурларда
        пайгамбардын (саллаллоху алеихи васаллам) сyннөттөрyнө баш ийип намаз
        окунушат. Алар: «...Жyздөрyндө сажда изинен калган белгилер бар...»
        (Фатх: 29) – деген аят менен сyрөттөлгөн инсандардын тобунда. Намаз –
        алар yчyн тойгус сезим. Ариине, нафил намаздар бул тойгус абалдын
        уланышы yчyн динибизге киргизилген. Өзгөчө, Азирети Паигамбарыбыз
        (саллаллоху алеихи васаллам) эч бир кyнөөсy болбосо да, тyнкyсyн буттары
        шишигиче намаз, чарчагыча Куран окучу. Ошондуктан парз намаздар нафил
        намаздарга, нафилдер парздарга тоскоол болбойт. Тескерисинче, нафилдер
        парздарды толуктаит. Бул жерде маанилyy болгон нерсе – аларды аткарууга
        аракет кылуу. Хадисте төмөнкyчө аитылат: «Пенде кыямат кyнy эң алгач
        намаздан сурак берет. Эгер намазы жакшы жана так болсо, албетте, ал
        пенде иигиликке жетип, тозоктон кутулат. Эгер намаз эч нерсеге
        жарабаган, начар болсо, ал киши зыянга учураган болот. Парз намазында
        кемчилик бар болсо, Алла Таала: «Карагыла, кулумдун парз намазын
        толуктоочу нафил намаздары барбы?» - деп сурайт. Башка амалдары да
        ушундай болот.» (Термезии, Салат, 188) Андай болсо, «Парздар жетет.
        Аларды толук аткарсак,жетиштyy!»- деп айтуу кайдыгерлик болуп калат.
        Анткени парз намаздарын толук, кемчиликсиз тyрдө орундатуу жана алардын
        бардыгын Алланын алдында кабыл кылына турган тyрдө аткаруу мyмкyн эмес!
        Канчалык аракет кылсак да, албетте, мезгил мезгили менен
        кемчиликтерибиз, каталарыбыз болбой койбойт. Андыктан мындай
        кемчиликтерибизди толукташ yчyн нафилдерден башка чара жок. Анткени
        окулган парз намаздын кайрадан окулушу мyмкyн болбогондуктан парздардагы
        кемчиликтер сөзсyз тyрдө нафилдер менен толукталышы зарыл. Бирок муну
        парздарды таштап, нафилдер менен алек болуу деп тyшyнбөш керек.
        Парздарды гана аткарып, нафилдерди таштоо дагы, нафилдерди аткарып,
        парздарды аткарбоо да – экөө тең туура эмес. Туурасы – парз менен кошо
        нафилдерди мyмкyн болушунча бейкуттук менен аткарууга аракеттенyy
        пайгамбар (саллаллоху уа саллам) жана сахабаларынын жашоосу – бизге бул
        боюнча жападан-жалгыз yлгy. Ошондой эле каза намаздары болгон кишинин
        жалаң казаларды окуп, нафилдерди ташташы да туура эмес. Анткени казалар
        макирөө38 убакыттарынан башка кyндyн бардык убактысында окулат.
      </Typography>
    </StyleContainer>
  );
};

export default NafilNamaz;

const StyleContainer = styled(Container)(() => ({
  textAlign: 'center',
  padding: '1rem',
}));
const StyleText = styled('div')(() => ({
  textAlign: 'center',
  padding: '1rem',
}));
