import { Container, Typography } from '@mui/material';
import React from 'react';

const Sham = () => {
  return (
    <Container>
      <div>
        <h2>Шам намазынын окулушу</h2>
        <br />
        <br />
        <h2>3 Рекет парздын окулушу</h2>
        <br />
        <br />
        <Typography>
          - Ниет кылынат. - Такбир айтылат. - Субханака окулат. -
          Аъузу...-бисмиллах.... - Фатиха сүрөсү окулат. - Бир сүрө (зам сүрө)
          окулат. - Рукуга ийилет. - Саждага барат. Экинчи рекетке турулат.
          <br />
          <br />
          - Бисмиллах..... - Фатиха сүрөсү окулат. - Бир сүрө (зам сүрө) окулат.
          - Рукуга ийилет. - Саждага барат. - Отурулат. - Аттахияту окулат.
          Үчүнчү Рекетке турулат.
          <br />
          <br />- Бисмиллах..... - Фатиха сүрөсү окулат. - Рукуга ийилет. -
          Саждага барат. - Отурулат (соңку) - Аттахияту окулат. - Аллахумма
          салли,Аллахумма барик дубалары окулат. - Раббана атина... дубасын
          окуйт. - Салам берилет. Салам бергенден кийин «Аллахумма антас- салам
          ва минкас-салам табаракта йа зал жалали вал икрам» – дегенден кийин эч
          нерсе сүйлөбөстөн шам намазынын сүннөтүн окуу үчүн ордунан турат.
        </Typography>
        <br />
        <br />
        <div>
          <h2>2 Рекет сүннөттүн окулушу</h2>
          <br />
          <br />
          <Typography>
            - Ниет кылынат. - Такбир айтылат. - Субханака окулат. -
            Аъузу...-бисмиллах.... - Фатиха сүрөсү окулат. - Бир сүрө (зам сүрө)
            окулат. - Рукуга ийилет. - Саждага барат. Экинчи рекетке турулат.
            <br />
            <br />- Бисмиллах..... - Фатиха сүрөсү окулат. - Бир сүрө (зам сүрө)
            окулат. - Рукуга ийилет. - Саждага барат. - Отурулат. - Аттахияту
            окулат. - Аллахумма салли,Аллахумма барик дубалары окулат. - Раббана
            атина... дубасын окуйт. - Салам берилет. Салам бергенден кийин
            «Аллахумма антас-салам ва минкас-салам табаракта йа зал жалали вал
            икрам» – деп окулат. Намаздан кийин үч жолу «Астагфируллах» дегенден
            соң «Аятул курси» жана отуз үч таспих (субханаллах), отуз үч тахмид
            (алхамдүлиллах), отуз үч такбир (Аллаху акбар) жана бир тахлил
            <br />
            <br /> (Ла илаха иллаллаху вахдаху ла шарика лах. Лахул мүлкү ва
            лахул хамду ва хува ала кулли шайин кадир) <br />
            <br /> окулат. Буларды ар ким өзү уга тургандай үн менен окуйт. Үндү
            чыгарып окуу бидат болуп саналат.
          </Typography>
        </div>
      </div>
    </Container>
  );
};

export default Sham;
