import React from 'react';
import Typography from '@mui/material/Typography';
import { Container, styled } from '@mui/material';

const TahadjudNamaz = () => {
  return (
    <StyleContainer>
      <Typography variant="h4" gutterBottom>
        ТАХАЖУД НАМАЗЫ КАНДАЙ ОКУЛАТ
      </Typography>
      <Typography variant="body1" gutterBottom>
        Бул намаздын сообу абдан чоң. Ал адам баласына бул жашоодо жана тиги
        дүйнөдө да береке алып келет. Медицина тармагынынын изилдөөчүлөрү ал
        намаздын ден соолукка өтө чоң пайдасы бар экенин айтышат. Сөз тахажжуд
        намазы тууралуу болууда.
      </Typography>
      <Typography variant="body1" gutterBottom>
        Нафил (кошумча) намаздардын катарында сообу абдан чоң болгон тахажжуд
        намазы да бар. Бирок бул намаз пайгамбарыбыз Мухаммедге (Алланын ага
        салам-салаваттары болсун) парз кылынган. Буга Куран аяттары далил.
        “Исра” сүрөсүнүн 79-аятында: «(Эй, Мухаммад!) Түндүн бир оокумунда
        ойгонуп, өзүңө гана таандык болгон кошумча ибадат катары Куран менен
        намаз оку».
      </Typography>
      <Typography variant="body1" gutterBottom>
        “Алардын капталдары төшөктөрүнөн көтөрүлүп турат да, өздөрүнүн Эгесине
        коркуу, үмүт менен жалынышат...” (Сажда 16). “Алар түн ичинде бир аз
        убакыт гана укташкан. Таң эрте менен Алладан кечирим сурашкан”. (Зарият
        17-18) Пайгамбарыбыз САВ мындай деген: «Түнкү намазды дайыма окугула.
        Анткени, түнкү намазды окуу силерден мурун өткөн жакшылардын адаты,
        Жараткан Эгеңерге багынуунун белгиси. Жамандыктарды жаап, күнөө жасоодон
        сактайт»(Тирмизи, Даават, 101). Дагы бир хадисте: «Парз намаздардан
        кийин эң сонун намаз - түнкү намаз» деп айткан. (Муслим, Сыям 202)
      </Typography>
      <Typography variant="body1" gutterBottom>
        Аллахтын элчиси (ага Алланын салават-саламдары болсун) тахажжуд намазы
        жөнүндө мындай деген: "Силер тахажжуд намазына көп көңүл бургула,
        анткени, тахажжуд намазы силерден мурунку өткөн коомдогу (салих) жакшы
        адамдар.
      </Typography>
      <Typography variant="h5" gutterBottom>
        Тахажжуд намазынан кандай окулат?
      </Typography>
      <Typography variant="body1" gutterBottom>
        Түн жарымынан баштап, саарлык маалына чейин. Пайгамбарыбыз (Алланын ага
        салам-салаваттары болсун) адатта тахажжуд намазын уктап турган соң
        түндүн жарымында, же түндүн акыркы бөлүгүндө (үчтөн бир бөлүгүндө)
        окуган.
      </Typography>
      <Typography variant="h5" gutterBottom>
        Канча рекет окулат?
      </Typography>
      <Typography variant="body1" gutterBottom>
        Тахажжуд намазы эки рекеттен сегиз рекетке чейин окулат. Ар эки рекетте
        бир салам берилип окулганы жакшы. Ниет коердо: «Тахажжуд намазынын
        (2,4,6,8) рекетин окууга ниет кылдым» деп айтуу зарыл.
      </Typography>
      <Typography variant="h5" gutterBottom>
        Тахажжуд намазынын сооптору:
      </Typography>
      <Typography variant="body1" gutterBottom>
        Жараткан Аллах Таала Ыйык Куран аяттарында түнкү намаздарга тургандар
        жөнүндө атайылап токтолот: «Алардын капталдары төшөктөрүнөн көтөрүлүп
        турат да, өздөрүнүн Эгесине коркуу, үмүт менен жалынышат...» (Сажда 16).
        «Алар түн ичинде бир аз убакыт гана укташкан. Таң эрте менен Алладан
        кечирим сурашкан». (Зарият 17-18) Пайгамбарыбыз САВ мындай деген: «Түнкү
        намазды дайыма окугула. Анткени, түнкү намазды окуу силерден мурун өткөн
        жакшылардын адаты, Жараткан Эгеңерге багынуунун белгиси. Жамандыктарды
        жаап, күнөө жасоодон сактайт»(Тирмизи, Даават, 101). Дагы бир хадисте:
        «Парз намаздардан кийин эң сонун намаз - түнкү намаз» деп айткан.
        (Муслим, Сыям 202)
      </Typography>
    </StyleContainer>
  );
};

export default TahadjudNamaz;

const StyleContainer = styled(Container)(() => ({
  textAlign: 'center',
}));
