import React from 'react';
import { Typography, Box, Container, styled } from '@mui/material';

const VitirVajibNamazy = () => {
  return (
    <StyleContainer style={{ textAlign: 'center' }}>
      <Box p={2}>
        <Typography variant="h6" gutterBottom>
          ВИТИР НАМАЗЫ ТӨМӨНКҮЧӨ ОКУЛАТ
        </Typography>
        <Typography paragraph>
          Ниет кылдым витир намазын калыс Аллах үчүн окууга, жүзүмдү кыбылага
          бурдум.
        </Typography>
        <Typography paragraph>
          "Аллооху Акбар" - деп эки кол кулак жумашактарына көтөрүлөт, аялдар
          болсо көкүрөктөрүнө көтөрүшөт. Анан кол байланат.
        </Typography>
        <Typography paragraph>
          Оң кол сол колдун үстүнө коюлуп киндиктин алдына байланат, аялдар
          болсо көкүрөктөрүнө байлашат. Бул акыбалда төмөнкүлөр окулат:
        </Typography>
        <Typography paragraph>
          A) Субхаанака аллоохумма уа бихамдика уа табаарокасмука уа таалаа
          жаддука уа лаа илааха гойрук.
        </Typography>
        <Typography paragraph>
          Б) Аъуузу биллаахи минаш-шайтоонир-рожиим.
        </Typography>
        <Typography paragraph>В) Бисмил-лаахир-рохмаанир-рохиим.</Typography>
        <Typography paragraph>
          Г) Альхамду лиллаахи роббиль ъааламиин. Аррохмаанир-рохиим. Маалики
          йаумид-диин. Иййаака наъбуду уа иййаака настаъиин.
          Ихдинас-сыроотоль-мустақыым. Сыроотол-лазиина ан-амта ъалайхим .
          Гойрил магдууби ъалайхим уа ладдоолиин. "Аамиин" - деп ичтен купуя
          айтылат.
        </Typography>
        <Typography paragraph>
          Фатихадан соң өзү билген кошумча сүрөө окулат, мисалы: "Аль-Аср"
          -сүрөөсү.
        </Typography>
        <Typography paragraph>
          Д) Уаль аср инналь инсаана лафии хуср Иллал-лазиина аамануу уа
          амилус-соолихаати Уа тауаасоубил хаккы уа тауаа соубис-собр "Аллооху
          Акбар" - деп рүкүгө кетет.
        </Typography>
        <Typography paragraph>
          Рүкүдө үч жолу "Сухбаана роббийал ъазиим" - деп айткан соң,
          "Самиаллооху лиман хамидах" - деп кайра тик туруп "Раббанаа лакаль
          хамд" деп айтылат.
        </Typography>
        <Typography paragraph>
          Тик турган соң "Аллооху Акбар" - деп саждага кетет. Сажда абалында
          "Субхаана роббийал аълаа" - деп үч жолу айтылат, "Аллооху Акбар" - деп
          баш көтөрүп каадага олтурат.
        </Typography>
        <Typography paragraph>
          Кайра экинчи саждага "Аллооху Акбар" - деп барып "Субхаана роббийал
          аълаа" - деп үч жолу айтылат.
        </Typography>
        <Typography paragraph>
          Мындан соң "Аллооху Акбар" - деп экинчи рекетке туруп кол байлайт.
        </Typography>
        <Typography paragraph>
          Кол байлагандан кийин кайра Фатиха сүрөө кошумча сүрөө менен окулат:
          Бисмил-лаахир-рохмаанир-рохиим Альхамду лиллаахи роббиль ъааламиин
          Аррохмаанир-рохиим. Маалики йаумид-диин. Иййаака наъбуду уа иййаака
          настаъиин. Ихдинас-сыроотоль-мустақыым. Сыроотол-лазиина ан-амта
          ъалайхим. Гойрил магдууби ъалайхим уа ладдоолиин. "Аамиин" - деп ичтен
          купуя айтылат.
        </Typography>
        <Typography paragraph>
          Қуль хуал-лооху ахад, аллоохус-сомад Лам йалид уа лам йуулад Уа лам
          йакул-лахуу куфу-уан ахад
        </Typography>
        <Typography paragraph>
          Рүкүгө барат "Аллооху Акбар" - деп. Рүкүдө үч жолу "Сухбаана роббийал
          ъазиим" - деп айткан соң, "Самиаллооху лиман хамидах" - деп кайра тик
          туруп "Раббанаа лакаль хамд" деп айтылат.
        </Typography>
        <Typography paragraph>
          Тик турган соң "Аллооху Акбар" - деп саждага кетет. Сажда абалында
          "Субхаана роббийал аълаа" - деп үч жолу айтат, "Аллооху Акбар" - деп
          баш көтөрүп каадага олтурат.
        </Typography>
        <Typography paragraph>
          Айткан соң "Аллооху Акбар" - деп кайра экинчи сажданы кылат, саждада
          "Субхаана роббийал аълаа" -деп үч жолу айтылат, "Аллооху Акбар" - деп
          баш көтөрүп каадага олтурат.
        </Typography>
        <Typography paragraph>
          8. Каадада "ат-тахыйат" - дубасы окулат. "Аттахыйаату лиллаахи
          уас-солауаату уат-тоййибаату Ассалааму алайка аййухан-набиййу Уа
          рохматуллоохи уа барокаатуху Ассалааму алайнаа уа алаа
          ыбаадил-лаахис-соолихиин Ашхаду аллаа илааха иллал-лооху Уа ашхаду
          анна Мухаммадан абдуху уа росуулуху".
        </Typography>
        <Typography paragraph>
          9. "Аттахыйат" окулгандан кийин "Аллооху Акбар" - деп тик туруп үчүнчү
          рекетке кол байлайт, Кол байлагандан кийин:
          "Бисмил-лаахир-рохмаанир-рохиим Альхамду лиллаахи роббиль ъааламиин
          Аррохмаанир-рохиим. Маалики йаумид-диин. Иййаака наъбуду уа иййаака
          настаъиин. Ихдинас-сыроотоль-мустақыым. Сыроотол-лазиина ан-амта
          ъалайхим. Гойрил магдууби ъалайхим уа ладдоолиин. "Аамиин" - деп ичтен
          купуя айтылат. Қуль аъуузу бироббиль фалақ Мин шарри маа холак Уа мин
          шарри гоосиқын изаа уакоб Уа мин шаррин-наффаасаати филь уқод Уа мин
          шарри хаасидин изаа хасад".
        </Typography>
        <Typography paragraph>
          Кошумча сүрөө окуп бүткөн соң рүкү кылбастан "Аллооху Акбар" деп кулак
          кагылып кунут дубасы окулат.
        </Typography>
        <Typography paragraph>
          <strong>Кунут дубасы</strong>
          Аллохумма иннаа настаыынука уа настагфирука уа настахдиик, уа ну'мину
          бика уа натуубу илайка уа на тауаккалу алайка, уа нуснии алайкал хойро
          куллахуу нашкурука, уа лаа накфурука уа нахлау уа натруку
          май-йафжурука. Аллохумма иййаака наъбуду уа лака нусоллии уа насжуду
          уа илайка нас'ъаа уа нахфиду уа наржуу рохматака, уа нахшаа азаабака
          инна азаабака бил куффаари мулхық.
        </Typography>
        <Typography paragraph>
          Кунут дубасы окулуп бүткөндө "Аллооху Акбар" - деп рүкүгө барат.
          Рүкүдө үч жолу "Сухбаана роббийал ъазиим" - деп айткан соң
          "Самиаллооху лиман хамидах" - деп кайра тик туруп "Раббанаа лакаль
          хамд" деп айтылат.
        </Typography>
        <Typography paragraph>
          "Аллооху Акбар" - деп саждага кетет. Сажда абалында "Субхаана роббийал
          аълаа" - деп үч жолу айтылат, "Аллооху Акбар" - деп баш көтөрүп
          каадага олтурат.
        </Typography>
        <Typography paragraph>
          Кайра экинчи саждага "Аллооху Акбар" - деп барып "Субхаана роббийал
          аълаа" - деп үч жолу айтылат.
        </Typography>
        <Typography paragraph>
          "Аллооху Акбар" - деп экинчи рекетке туруп кол байланат. Кол
          байлагандан кийин "Фатиха сүрөө" менен кошумча сүрөө окулат.
        </Typography>
        <Typography paragraph>
          1. Бисмил-лаахир-рохмаанир-рохиим 2. Кул хуаллооху ахад 3.
          Аллоохус-сомад 4. Лам йалид уа лам йуулад 5. Уа лам йакул-лахуу
          куфууан ахад
        </Typography>
        <Typography paragraph>
          Рүкүгө барат "Аллооху Акбар" - деп. Рүкүдө үч жолу "Сухбаана роббийал
          ъазиим" - деп айткан соң, "Самиаллооху лиман хамидах" - деп кайра тик
          туруп "Раббанаа лакаль хамд" деп айтылат.
        </Typography>
        <Typography paragraph>
          Тик турган соң "Аллооху Акбар" - деп саждага кетет. Саждада "Субхаана
          роббийал аълаа" - деп үч жолу айтылат, "Аллооху Акбар" - деп баш
          көтөрүп каадага олтурат.
        </Typography>
        <Typography paragraph>
          Кайра экинчи саждага "Аллооху Акбар" - деп барып "Субхаана роббийал
          аълаа" - деп үч жолу айтылат.
        </Typography>
        <Typography paragraph>
          "Аллооху Акбар" - деп экинчи рекетке туруп кол байланат.
        </Typography>
        <Typography paragraph>
          Кол байлагандан кийин "Ташаңгы фатиха" менен кошумча сүрөө окулат.
        </Typography>
        <Typography paragraph>
          1. Бисмил-лаахир-рохмаанир-рохиим 2. Ихсоро 3. Кул хуаллооху ахад 4.
          Аллоохус-сомад 5. Лам йалид уа лам йуулад 6. Уа лам йакул-лахуу
          куфууан ахад
        </Typography>
        <Typography paragraph>
          Рүкүгө барат "Аллооху Акбар" - деп. Рүкүдө үч жолу "Сухбаана роббийал
          ъазиим" - деп айткан соң, "Самиаллооху лиман хамидах" - деп кайра тик
          туруп "Раббанаа лакаль хамд" деп айтылат.
        </Typography>
        <Typography paragraph>
          Тик турган соң "Аллооху Акбар" - деп саждага кетет. Саждада "Субхаана
          роббийал аълаа" - деп үч жолу айтылат, "Аллооху Акбар" - деп баш
          көтөрүп каадага олтурат.
        </Typography>
        <Typography paragraph>
          Кайра экинчи саждага "Аллооху Акбар" - деп барып "Субхаана роббийал
          аълаа" - деп үч жолу айтылат.
        </Typography>
        <Typography paragraph>
          Саждадан кийин аятал курси окулуп, дуо айыңыз.
        </Typography>
        <Typography paragraph>
          "Уа соллаллаху алал Муҗаммадин уа алал аали Муҗаммад, кама соллайта
          алал Ибраҳима уа алал аали Ибраҳим, иннака ҳамидум-мажид, аллоохумма
          баарик алаа Муҗаммадин уа алаа аали Муҗаммад, кама бааракта алаа
          Ибраҳима уа алаа аали Ибраҳим, иннака ҳамидум-мажид".
        </Typography>
        <Typography paragraph>
          Сол көзүңүздү ачып айтып: "Ассалааму алайкум уа рохматуллох" - деп
          аяктайт.
        </Typography>
        <Typography paragraph>
          Келеси аятты окуп, адууга алып барабыз: "Кул кайфа йухиихиллазии
          аншааакум алляати ааууали марротин, уа ҳуа алал арши мустиваак,
          юуфиддул қолаилаа иййихаа ҳин маа уафидду валааудду хифзухума уа ҳуа
          алал азийзил кабийр".
        </Typography>
      </Box>
    </StyleContainer>
  );
};

export default VitirVajibNamazy;

const StyleContainer = styled(Container)(() => ({
  textAlign: 'center',
}));
