const AllahsName = [
  {
    id: 1,
    name: 'الرحمن',
    transliteration: ' Ар-Рахман.',
    value:
      'Мааниси – Ырайымдуу. Бул дүйнөдө баардык макулуктарга ырайымын төгүүчү. Ошондуктан Ар-Рахман болгон Аллах бул дүйнөдө ыймандуу, ыймансыз, күнөөкөр-күнөөсүз деп бөлбөстөн, баардык адамдарга тегиз ырайым көргөзөт.',
  },
  {
    id: 2,
    name: 'الرحيم',
    transliteration: 'Ар-Рахим.',
    value:
      'Мааниси – Ырайымдуу. Мунун Ар-Рахмандан айырмасы Акыретте жалаң ыймандууларга ырайым кылат. Демек, Аллах Ар-Рахман сыпаты менен бул дүйнөдө баардык элдерге, ал эми, Ар-Рахим сыпаты менен Акыретте жалаң ыймандууларга боорукерлик кылат.',
  },
  {
    id: 3,
    name: 'الملك',
    transliteration: 'Аль-Малик.',
    value:
      '«Чыныгы Падыша» деген маанини билдирет. Ал Өзүнүн сыпатында эч нерсеге муктаж эмес. Ааламдагы баардык нерселер жаратылууда жана бар болуп жашоодо Аллахка муктаж болушат. Аллах Таала айтат: «Оо, инсандар! Силер Аллахка муктажсыңар. Аллах болсо, эч качан муктаж болбогон жана мактоого татыктуу».(Фатир,15-аят).',
  },
  {
    id: 4,
    name: 'القدوس',
    transliteration: 'Аль-Куддус.',
    value:
      '«Ыйык», «Таза» деген маанини түшүндүрөт. Аллах Таала ар кандай кемчилдиктерден таза, пенделерине, жараткан макулуктарына окшош болуудан Таза. Биз Аны канчалык улук жана аруу-таза деп ойлосок, мына ушул оюбуздагыдан да аруу-тазараак деп ишенүүбүз керек.',
  },
  {
    id: 5,
    name: 'السلام',
    transliteration: 'Ас-Салам.',
    value:
      'Аллах Тааланын «Ас-Салам» деген ысым-сыпаты Анын таберик Затынын аруулугун, сыпаттарынын кемчилдиктен, иштеринин жамандыктардан саламат экенин билдирет.',
  },
  {
    id: 6,
    name: 'المؤمن',
    transliteration: 'Аль-Муьмин.',
    value:
      'Кыскача мааниси: «Баардык нерселерге амандык тынчтык,бейпилдик берүүчү». Баардык ааламга бейпилдик себептерин жаратып берүү менен, баардык ааламга тынчтык, бейпилдик тартуу кылат.',
  },
  {
    id: 7,
    name: 'المهيمن',
    transliteration: 'Аль-Мухаймин.',
    value:
      'Мааниси: «Макулуктардын үстүнөн Көзөмөлдөп, бардык нерселерди билими менен камтып туруучу». Аллах Таала бүткүл макулуктардын амалдарына, ырыскыларына жана жашоодогу мөөнөттөрүнө назар салып туруучу.',
  },
  {
    id: 8,
    name: 'العزيز',
    transliteration: 'Аль-Азиз.',
    value:
      '«Аль-Азиздин» мааниси: «Ыззат жана Кудурет ээси». Толук азиздик жана толук кудурет ээси болгон Аллах Таала жалгыз, окшошу жок, болушу дагы мүмкүн эмес. Ага окшогон нерсени кыялга дагы келтирүү мүмкүн эмес! Аллах Таала айтат: «Ыззат-азиздик Аллахка, Аллахтын элчисине жана ыймандуу пенделерге таандык. Бирок мунафыктар (аны)билишпейт». (Мунафикун, 8-аят).',
  },
  {
    id: 9,
    name: 'الجبار',
    transliteration: 'Аль-Жаббар.',
    value:
      '«Каалоосу мажбур түрдө таасир этүүчү». Аллах Таала ар бир нерсени Өзү жараткан мыйзамга мажбур түрдө баш ийдирет. Бирок, эч ким Аллахты өзүнүн каалоосуна мажбур кыла албайт. Демек, Аллах Таала гана Аль-Жаббар сыпатына толук-кемелдүү ээ боло алат.',
  },
  {
    id: 10,
    name: 'المتكبر',
    transliteration: 'Аль-Мутакаббир.',
    value:
      'Бул ысымдын мааниси: «Өзүнүн Улуктугуна таандык болгон нерселерден башкасын арзыбаган нерсе деп билүүчү». Ооба, Аллах Таала эң Улуу жана эң Бийик. Мына ушул сыпатка ээ болгон Затка гана Мутакаббир сыпаты ылайык. ',
  },
  {
    id: 11,
    name: 'الخالق',
    transliteration: 'Аль-Халик.',
    value: '«Ар бир нерсени өлчөм менен өлчөп, Жаратуучу».',
  },
  {
    id: 12,
    name: 'البارئ',
    transliteration: 'Аль-Бариь.',
    value: '«Ар бир нерсени өлчөм менен өлчөп, жоктон бар кылуучу».',
  },
  {
    id: 13,
    name: 'المصور',
    transliteration: 'Аль-Мусаввир.',
    value:
      '«Өлчөм менен жасалган нерселерди жоктон бар кылгандан кийин ага «зыйнат жана сүрөт-шекил берүүчү» деген маанини билдирет.',
  },
  {
    id: 14,
    name: 'الغفار',
    transliteration: 'Аль-Гаффар.',
    value:
      '«Көркөм нерселерди көрсөтүп, жаман нерселерди жашыруучу, пенделердин айып-кемчиликтерин жана күнөө иштерин ашкере кылбай жаап-жашырып, кечирүүчү».',
  },
  {
    id: 15,
    name: 'القهار',
    transliteration: 'Аль-Каххар.',
    value:
      '«Душмандардын омурткаларын сындырып, жеңүүчү» же «Аларды кордук менен жеңүүчү» же «Ааламдагы баардык макулуктарды Өзүнүн кудурети менен баш ийдирүүчү» деген маанилерди билдирет.',
  },
  {
    id: 16,
    name: 'الوهاب',
    transliteration: 'Аль-Ваххаб.',
    value:
      '«Белек (хадия) берүүчү», «Мээрбан», «Өзүнүн нээматтарын бекер берүүчү». Аллах Таала Өзүнүн нээматтарын пенделерден эч нерсе талап кылбастан берет. Бул - чыныгы белек. Ааламдагы баардык макулуктар Аллах Таалага муктаж. Аллах Таала алардын кажеттерин эч кандай акы талап кылбастан аткарып турат.',
  },
  {
    id: 17,
    name: 'الرزاق',
    transliteration: 'Ар-Раззак.',
    value:
      'Мааниси: «Ырыскыларды жаратуучу жана баардык макулуктарга ырыскы жеткирип туруучу». Ырыскынын эки түрү болот: Биринчиси: Биздин дене-мүчөлөрүбүз азык алган жемиштер жана суусундуктар. Экинчиси: Жүрөгүбүз жана жаныбыздын азыктары болгон илим-билим, айрыкча шарият илимдери.Пенделер Аллах Тааланын «Ар - Раззак» сыпатын түшүнүп билгенден кийин, ырыскыны жалгыз гана Аллах Тааладан үмүт кылып, Алахтын Өзүнө гана тобокел кылуусу керек.',
  },
  {
    id: 18,
    name: 'الفتاح',
    transliteration: 'Аль-Фаттах.',
    value:
      'Мааниси:«Өзүнүн ырайым казыналарын ачуучу, хидаяты менен ар кандай мүшкүлдөрдү ачып таштоочу Зат». Аллах Таала Өзүнө таза ибадат кылган пенделерине ырайым (Рахмат) эшиктерин ачат.',
  },
  {
    id: 19,
    name: 'العليم',
    transliteration: 'Аль-Алийм.',
    value:
      'Мааниси:«Өтө Билимдүү, Билүүчү, Даанышман». Аллах Таала ааламдардагы баардык нерселерди, планеталардагы бардык аракеттерди; эң чоң гигант жылдыздардын аракеттеринен тартып, көзгө көрүнбөй турган атомдордун дагы аракеттерин билип турат.',
  },
  {
    id: 20,
    name: 'القابض',
    transliteration: 'Ал-Кообизу.',
    value:
      'Мааниси:"Ырыскыны азайтуучу". Ким нандын төрт туурамына, "Ал-Кообизу"ну жазып 40 күн жесе, анда Алла Таала буйурса ал ачкалык, чаңкоо, жара жана башка оорулардын кыйынчылыгынан сак болот.',
  },
  {
    id: 21,
    name: 'الباسط',
    transliteration: 'Ал-Бааситу.',
    value:
      'Мааниси::"Ырыскыны көбөйтүүчү". Ким күн сайын чашт намазынан кийин асман жака колун көтөрүп 10 жолу "Ал-Бааситу"ну окуп, соң колун бетине сүрсө, анда Алла Таала аны бай кылыт жана ал эч качан эч кимге муктаж болбойт.',
  },
  {
    id: 22,
    name: 'الخافض',
    transliteration: 'Ал-Хоофизу.',
    value:
      'Мааниси:"Каапырлардын мертебесин төмөндөтүүчү". Ким күн сайын 500 жолу "Йаа-Хоофизу"ну окуса, анда Алла Таала анын бардык кажеттерин толуктайт жана андан бардык кыйынчылыктарды кетирет. Ким үч күн орозо дөкармагандан кийин төртүнчү күнү бир жерге отуруп 70 жолу "Ал-Хоофизу"ну окуса, анда Алла Таала буйурса ал душмандарга каршы жеңишке ээ болот.',
  },
  {
    id: 23,
    name: 'الرافع',
    transliteration: 'Ар-Роофиу.',
    value:
      'Мааниси:"Мартабаларды көтөрүүчү". Ким ай сайын айдын он төртүнчү түнү түндүн жарым түндө 100 жолу "Ар-Роофиу"ну окуса, Алла Таала аны бардык макулуктарга муктажсыз жана бай кылат.',
  },
  {
    id: 24,
    name: 'المعز',
    transliteration: 'Ал-Муиззу.',
    value:
      'Мааниси:"урмат-сый берүүчү". Ким дүйшөмбү же жума күндөрү шам намазынан кийин 40 жолу "Йаа-Муизззу"ну окуса, анда Алла Таала аны адамдардын ичинде урматтуу жана сымбаттуу кылып койот.',
  },
  {
    id: 25,
    name: 'المذل',
    transliteration: 'Ал-Музиллу.',
    value:
      'Мааниси:"Кор кылуучу". Ким 75 жолу "Йаа-Музиллу"ну окуп, башын саждага койуп дуба кылса , анда Алла Таала аны кызгануучулар, заалымдар жана душмандардын жамандыгынан сактайт. Эгер анда өзгөчө душманы болсо жана  ал сажда да туруп анын атын айтып:"Эй, Алла! Баланча заалымдын же душмандын жамандыгынан мени сакта!"-деп дуба кылса, анда Алла Таала буйурса анын дубасы кабыл болот.',
  },
  {
    id: 26,
    name: 'السميع',
    transliteration: 'Ас-Самииу.',
    value:
      'Мааниси:"Бардык добуштарды угуучу". Ким бейшенби күнү чашт намазынан кийин 500, же 100, же 50 жолу "Йаа-Самииу"ну окуса, анда Алла Таала буйурса анын дубасы кабыл болот. Аны окуп жаткан учурда эч ким менен сүйлөшпөө  керек! Ким бейшенби күну багымдат анмазынын сүннөтү менен празынын ортосунда 100 жолу аны окуса, анда Алла Таала ага өзгөчө түшүнүк берет.',
  },
  {
    id: 27,
    name: 'البصير',
    transliteration: 'Ал-Басииру.',
    value:
      'Мааниси:"Бардык нерселерди көрүүчү". Ким жума намаздан кийин 100 жолу "Йаа-Басииру"ну окуса, анда Алла Таала анын көзүн курч кылат жана жүрөгүнө нур пайда кылат. Ким жума күнү кечинде аны өтө көп окуса, анда Алла Таала анын жүрөгүнө кашф жана илхамды (Алла тараптан дилге келген нерсе) салат.',
  },
  {
    id: 28,
    name: 'الحكم',
    transliteration: 'Ал-Хакаму.',
    value:
      'Мааниси:"Өкүм чыгаруучу". Ким түндүн акыркы бөлүгүндө 99 жолу "Ал-Хакаму"ну окуса, анда Алла Таала анын жүрөгүн сырдуу жана нурдуу кылат. Ким жума күнү кечинде аны өтө көп окуса, анда Алла Таала анын жүрөгүнө кашф жана илхамды (Алла тараптан дилге келген нерсе) салат.',
  },
  {
    id: 29,
    name: 'العدل',
    transliteration: 'Аль-Адл.',
    value:
      'Мааниси: «Адилет кылуучу».Пенделер Адилет кылуучуну жакшы таанып билүүсү үчүн эң биринчи адилет эмне экенин түшүнүүсү керек. Аллах Таала ааламдагы ар бир нерсени адилеттүүлүк менен жаратып, жоктон бар кылып, ар бир макулукка өзүнө таандык шекил жана өзүнө гана таандык милдет берди. Демек, адилет деп ар бир нерсе жана ар бир мүчөнүн Аллах каалагандай жана Аллах көрсөткөн милдетти так аткаруусуна айтылат.',
  },
  {
    id: 30,
    name: 'اللطيف',
    transliteration: 'Ал-Латийф.',
    value:
      'Мааниси: «Иште же мамиледе өтө жумшак», «Өтө терең илимдүү». Аллах Тааланын өтө назик, терең илими менен кылган иштери жана мамилеси «лутф» деп аталат. Аллах Тааланын пенделерине кылган лутфу – жумшактыгы өтө чексиз, муну айтып бүтүрүү мүмкүн эмес.',
  },
  {
    id: 31,
    name: 'الخبير',
    transliteration: 'Аль-Хабийр.',
    value:
      'Мааниси: «Баардык жашыруун жана ашкере нерселерден кабардар». Ааламда болуп жаткан иштердин баарынан: мейли атомдордун аракети болсун, инсандардын жашыруун же ашкере аракеттери болсун же болбосо, кыялындагы ой-санаасы болсун... булардын баарынан Аллах Таала – Ал Хабийр (Кабардар).',
  },
  {
    id: 32,
    name: 'الحليم',
    transliteration: 'Аль-Халийм.',
    value:
      'Мааниси: «Жазалоого шашылбай турган, хилм (жумшактык) менен жакшылык кылып туруучу жана пенделердин күнөөлөрүн кечирүүчү». Аллах Таала пенделер Өзүнүн өкүмдөрүнө каршы амалдарды кылып жаткандарын көрүп турса дагы азап берүүгө жана өч алууга шашылбайт.',
  },
  {
    id: 33,
    name: 'العظيم',
    transliteration: 'Аль-Азийм.',
    value:
      'Мааниси: «Улуу, Бийик». Инсан Аллахты канчалык Улуу деп ойлобосун Аллах мына ушул ой-санаадан дагы Улуу жана Бийик!',
  },
  {
    id: 34,
    name: 'الغفور',
    transliteration: 'Аль-Гафуур.',
    value:
      '«Кемелдүү, толук кечирүүчү» дегенди билдирет. Бул сыпат “Ал–Гаффар” сыпатына караганда толугураак маанини түшүндүрөт. Аллах Таала “Ал–Гаффар” сыпаты менен пенделердин кайра-кайра жасаган күнөөлөрүн кечирсе, “Ал–Гафуур” сыпаты менен кайра-кайра кечирүү менен бирге толук жана кемелдүү кечирет.',
  },
  { id: 35, name: 'الشكور', transliteration: '', value: '' },
  { id: 36, name: 'العلي', transliteration: '', value: '' },
  { id: 37, name: 'الكبير', transliteration: '', value: '' },
  { id: 38, name: 'الحفيظ', transliteration: '', value: '' },
  { id: 39, name: 'المقيت', transliteration: '', value: '' },
  { id: 40, name: 'الحسيب', transliteration: '', value: '' },
  { id: 41, name: 'الجليل', transliteration: '', value: '' },
  { id: 42, name: 'الكريم', transliteration: '', value: '' },
  { id: 43, name: 'الرقيب', transliteration: '', value: '' },
  { id: 44, name: 'المجيب', transliteration: '', value: '' },
  { id: 45, name: 'الواسع', transliteration: '', value: '' },
  { id: 46, name: 'الحكيم', transliteration: '', value: '' },
  { id: 47, name: 'الودود', transliteration: '', value: '' },
  { id: 48, name: 'المجيد', transliteration: '', value: '' },
  { id: 49, name: 'الباعث', transliteration: '', value: '' },
  { id: 50, name: 'الشهيد', transliteration: '', value: '' },
  { id: 51, name: 'الحق', transliteration: '', value: '' },
  { id: 52, name: 'الوكيل', transliteration: '', value: '' },
  { id: 53, name: 'القوي', transliteration: '', value: '' },
  { id: 54, name: 'المتين', transliteration: '', value: '' },
  { id: 55, name: 'الولي', transliteration: '', value: '' },
  { id: 56, name: 'الحميد', transliteration: '', value: '' },
  { id: 57, name: 'المحصي', transliteration: '', value: '' },
  { id: 58, name: 'المبدئ', transliteration: '', value: '' },
  { id: 59, name: 'المعيد', transliteration: '', value: '' },
  { id: 60, name: 'المحيي', transliteration: '', value: '' },
  { id: 61, name: 'المميت' },
  { id: 62, name: 'الحي' },
  { id: 63, name: 'القيوم' },
  { id: 64, name: 'الواجد' },
  { id: 65, name: 'الماجد' },
  { id: 66, name: 'الواحد' },
  { id: 67, name: 'الأحد' },
  { id: 68, name: 'الصمد' },
  { id: 69, name: 'القادر' },
  { id: 70, name: 'المقتدر' },
  { id: 71, name: 'المقدم' },
  { id: 72, name: 'المؤخر' },
  { id: 73, name: 'الأول' },
  { id: 74, name: 'الآخر' },
  { id: 75, name: 'الظاهر' },
  { id: 76, name: 'الباطن' },
  { id: 77, name: 'الوالي' },
  { id: 78, name: 'المتعالي' },
  { id: 79, name: 'البر' },
  { id: 80, name: 'التواب' },
  { id: 81, name: 'المنتقم' },
  { id: 82, name: 'العفو' },
  { id: 83, name: 'الرؤوف' },
  { id: 84, name: 'مالك الملك' },
  { id: 85, name: 'ذو الجلال والإكرام' },
  { id: 86, name: 'المقسط' },
  { id: 87, name: 'الجامع' },
  { id: 88, name: 'الغني' },
  { id: 89, name: 'المغني' },
  { id: 90, name: 'المانع' },
  { id: 91, name: 'الضار' },
  { id: 92, name: 'النافع' },
  { id: 93, name: 'النور' },
  { id: 94, name: 'الهادي' },
  { id: 95, name: 'البديع' },
  { id: 96, name: 'الباقي' },
  { id: 97, name: 'الوارث' },
  { id: 98, name: 'الرشيد' },
  { id: 99, name: 'الصبور' },
];

export { AllahsName };
