const randomText = [
  {
    id: 1,
    text: 'ЖАШООДО КОЛДОНУУГА ЭҢ КЕРЕКТҮҮ КЫСКА-НУСКА ХАДИСТЕР ТОПТОМУ.',
  },
  {
    id: 2,
    text: 'قال رسول الله صلى الله عليه وسلم : « إن الله لا ينظر إلى صوركم و أموالكم ، و لكن ينظر إلى قلوبكم و أعمالكم ». 1\n\nЧындыгында Аллах Таала силердин келбетиңерге жана байлыгыңарга карабайт. Бирок силердин жүрөгүңөргө жана амалыңарга карайт.',
  },
  {
    id: 3,
    text: 'قال رسول الله صلى الله عليه وسلم : « لولا أن أشق على أمتي، لأمرتهم بالسواك عند كل صلاة ». \n\n2-Үммөттөрүмө оор болбогондо, ар бир намаздын алдында мисвак колдонууну сөзсүз буюрмакмын.',
  },
  {
    id: 4,
    text: 'قال رسول الله صلى الله عليه وسلم : « من بطأ به عمله لم يسرع به نسبه ».\n\n3-Кимди өз иши (ибадаттан тосуп) акырындаштырган болсо, анын ата - тектүүлүгү алдыга жылууга жардам бере албайт.',
  },
  {
    id: 5,
    text: 'قال رسول الله صلى الله عليه وسلم : « من دل على خير فله مثل أجر فاعله\n\n4-Ким жакшылыкты ( жасоону башкаларга) үйрөтсө, амал кылганга берилген сооп ага да берилет.',
  },
  {
    id: 6,
    text: 'قال رسول الله صلى الله عليه وسلم : « من رضي بالله ربا، و بالاسلام دينا، و بمحمد نبيا، وجبت له الجنة ». \n\n5-Ким Жаратуучусун Аллах деп, динин Ислам деп, Пайгамбарын Мухаммад (c.a.в) деп ыраазы болсо, ага Бейиш важиб болот.',
  },
  {
    id: 7,
    text: 'قال رسول الله صلى الله عليه وسلم: « من صلى علي صلاة صلى الله عليه بها عشرا ».\n\n6-Ким мага бир жолу салават айтса, Аллах Таала ага он жолу салават айтат.',
  },
  {
    id: 8,
    text: 'قال رسول الله صلى الله عليه وسلم : « من يرد الله به خيرا يفقهه في الدين ». 7\n\nАллах кимге жакшылыкты кааласа, ага диний илиминен түшүнүк берет.',
  },
  {
    id: 9,
    text: '(قال رسول الله صلى الله عليه وسلم : « من كان له فضل زاد، فليعد به على من لا زاد له ».\n\n8-Кимде ашыкча азыгы болсо, аны азыгы жокторго берсин!',
  },
  {
    id: 10,
    text: 'قال رسول الله صلى الله عليه وسلم : « كلكم راع و كلكم مسؤول عن رعيته »\n\n9-Силердин ар бириңер башчысыңар жана ар бириңер кол астыңардагылар тууралуу (Кыямат күнү) суралуучусуңар.',
  },
  {
    id: 11,
    text: 'قال رسول الله صلى الله عليه وسلم : « من سلك طريقا يلتمس فيه علما ، سهل الله له به طريقا الى الجنة\n\n10-Ким илим алуу үчүн жолго (же сапарга) чыккан болсо, Аллах ага Бейишке алып барчу жолун жеңил кылып койот.',
  },
];

export { randomText };
