const randomText = [
  {
    id: 1,
    text: 'Чындыгында Аллах Таала силердин келбетиңерге жана байлыгыңарга карабайт. Бирок силердин жүрөгүңөргө жана амалыңарга карайт.',
  },
  {
    id: 2,
    text: 'Үммөттөрүмө оор болбогондо, ар бир намаздын алдында мисвак колдонууну сөзсүз буюрмакмын.',
  },
  {
    id: 3,
    text: 'Кимди өз иши (ибадаттан тосуп) акырындаштырган болсо, анын ата - тектүүлүгү алдыга жылууга жардам бере албайт.',
  },
  {
    id: 4,
    text: 'Ким жакшылыкты ( жасоону башкаларга) үйрөтсө, амал кылганга берилген сооп ага да берилет.',
  },
  {
    id: 5,
    text: 'Ким Жаратуучусун Аллах деп, динин Ислам деп, Пайгамбарын Мухаммад (c.a.в) деп ыраазы болсо, ага Бейиш важиб болот.',
  },
  {
    id: 6,
    text: 'Ким мага бир жолу салават айтса, Аллах Таала ага он жолу салават айтат.',
  },
  {
    id: 7,
    text: 'Аллах кимге жакшылыкты кааласа, ага диний илиминен түшүнүк берет.',
  },
  {
    id: 8,
    text: 'Кимде ашыкча азыгы болсо, аны азыгы жокторго берсин!',
  },
  {
    id: 9,
    text: 'Силердин ар бириңер башчысыңар жана ар бириңер кол астыңардагылар тууралуу (Кыямат күнү) суралуучусуңар.',
  },
  {
    id: 10,
    text: 'Ким илим алуу үчүн жолго (же сапарга) чыккан болсо, Аллах ага Бейишке алып барчу жолун жеңил кылып койот.',
  },
];

export { randomText };
