import img from '../assets/images/1200px-Rashidun_Caliph_Uthman_ibn_Affan_-_عثمان_بن_عفان_ثالث_الخلفاء_الراشدين.svg.png';

const oku = [
  {
    name: 'Бир алма жана Имам Азамдын атасы',
    path: '/',
    text: 'Бир алма жана Имам Азамдын атасы',
    image: img,
  },
  {
    name: 'Жаш бойдон калуунун сыры',
    path: '/',
    text: 'Жаш бойдон калуунун сыры',
    image: img,
  },
  {
    name: '"Бисмиллах" сөзүнүн үстөмдүгү',
    path: '/',
    text: '"Бисмиллах" сөзүнүн үстөмдүгү',
    image: img,
  },
  {
    name: 'Бош үйгө ууру кирбейт',
    path: '/',
    text: 'Бош үйгө ууру кирбейт',
    image: img,
  },
  {
    name: 'Бош үйгө ууру кирбейт',
    path: '/',
    text: 'Бош үйгө ууру кирбейт',
    image: img,
  },
  {
    name: 'Кимди сүйсөң акыретте аны менен бирге болосуң',
    path: '/',
    text: 'Кимди сүйсөң акыретте аны менен бирге болосуң',
    image: img,
  },
  {
    name: 'Кимди сүйсөң акыретте аны менен бирге болосуң',
    path: '/',
    text: 'Кимди сүйсөң акыретте аны менен бирге болосуң',
    image: img,
  },
  {
    name: 'Кимди сүйсөң акыретте аны менен бирге болосуң',
    path: '/',
    text: 'Кимди сүйсөң акыретте аны менен бирге болосуң',
    image: img,
  },
];

export { oku };
